{
    "What is the commonality between Data SAP and Data link control SAP?": "Both the Data SAP and the Data‐Link Control SAP are simply two different Service Access Points in the data-link layer.  In other words:\n\n  1.  They both sit at the same layer (the data-link layer) as defined in the OSI model.\n  2.  Each provides an interface (“access point”) upward to Layer 3 (the network layer or “higher layers”) and downward to the connection-coordination/physical-MAC machinery.\n  3.  Both hand off primitives and information (whether payload data or link/control/status information) between higher-layer protocols and the lower-layer communication technology.\n  4.  They are specified in exactly the same way—as SAPs that define how upper and lower layers exchange data, status, error or control messages.",
    "What is the commonality between basic signaling and high-level communication?": "Basic signaling and high-level communication are not two independent charging modes but rather two layers of the same EV–EVSE communication system.  Their commonalities are:  \n1. Both are specified (or referenced) in the ISO 15118 suite and IEC 61851 standards as the mandatory means by which an electric vehicle and its supply equipment exchange information.  \n2. Both use the same physical link (the control pilot circuit and/or PLC over the charging cable) to carry their signals.  Basic signaling carries the PWM duty-cycle “on/off” messages, while high-level communication (HLC) rides on top of that link (e.g. via HomePlug Green PHY) to exchange richer data.  \n3. Both are required for bidirectional communication in a V2G setup: basic signaling establishes and indicates basic charging state and available current, and HLC adds the higher-level commands and data needed for functions such as Plug & Charge, authentication (EIM/PNC), charge‐loop management and grid-support features.  \n4. Both operate in tandem during the V2G setup and charging loop—basic signaling provides the foundation (“keep-alive,” duty cycle limits, state transitions B0→B1→B2), and HLC builds on it to negotiate session parameters, control charging in real time, and support advanced services.",
    "What is the commonality between MTC and PTC?": "Both the Main Test Component (MTC) and the Parallel Test Component (PTC) are not stand‐alone applications but modules in the same TTCN-3-based test framework for IEC 61851-1 PWM and communication testing.  In particular:\n\n1.  They are both “components of the test configuration”  \n    – Each is defined in the TTCN-3 test configuration (i.e. they each have a <component> declaration and a set of ports mapped from abstract TSI ports to real system ports).  \n    – Their ports (e.g. pt_HAL_61851_Internal_Port, pt_SLAC_Port, pt_HAL_61851_Port) are mapped according to the underlying Test System Interface.\n\n2.  They both synchronise to the same hardware abstraction of the control-pilot (PWM) signal  \n    – Both use HAL_61851_Internal_Port to observe or drive the IEC 61851-1 PWM state (PTC for monitoring, MTC for control and verdicts).  \n    – Both see the same PWM events and duty-cycle changes, ensuring that the test harness and the SUT under test stay in lock-step.\n\n3.  They share responsibility for EIM (Electricity Information Management) status handling  \n    – The PTC continuously observes the outcome of the EIM authorization sequence.  \n    – When authorization succeeds or fails, the PTC invokes a callback into the MTC.  \n    – The MTC in turn processes that incoming EIM status (requirement V2G5-034) to decide whether to proceed with the next phase of the test.\n\n4.  They both support SECC and EVCC conformance testing under the same standards  \n    – Both implement functions mandated by IEC 61851-1 (e.g. changing valid PWM ranges per V2G5-028) and feed verdicts back out of the TTCN-3 test harness.  \n    – Both are driven by the same PICS/PIXIT selections and must interoperate to execute multi-phase test cases (e.g. SLAC, PLCLinkStatus, duty-cycle tests).\n\nIn short, the “main” versus “parallel” distinction simply assigns them different roles (one orchestrates the test, the other watches a parallel channel), but they are built on the same port-mapping, HAL interface, EIM-status callbacks and TTCN-3 configuration, and together form the complete IEC 61851-1 / SLAC / EIM conformance test harness."
}