{
    "What is the difference between Data SAP and Data link control SAP?": "A Service Access Point (SAP) is simply a named interface through which one layer of the protocol stack offers services to the layer immediately above it.  In the Data Link layer of the EV/PLC (e.g. HomePlug Green PHY/G3-PLC) stack you actually get two distinct SAPs: one for carrying user data (the “Data SAP”) and one for carrying link-management and control information (the “Data Link Control SAP”).  Here is how they differ:\n\n1. Purpose and Functionality  \n   • Data SAP  \n     – Carries user-payload frames (Ethernet-II or other data packets) between Layer 3 (Network) and the Data Link layer.  \n     – Primitives include things like DATA-LINK-SEND.request / DATA-LINK-SEND.confirm and DATA-LINK-RECEIVE.indication.  \n     – Identified in HomePlug Green PHY as the “ETH SAP” when converging Ethernet traffic over PLC.  \n   • Data Link Control SAP  \n     – Carries link-status, error indications, flow-control commands, matching/initialization messages, etc.  \n     – Primitives include D-LINK_READY.indication(link-established or no-link), D-LINK_ERROR.request, etc.  \n     – Provides the higher layers (e.g. the SLAC matching/validation logic or network-layer control protocols) with up-to-date information on whether the PLC link is up, what errors have occurred, and when to retry or tear down the link.\n\n2. Who Provides Them  \n   • Data SAP  \n     – Exposed by the convergence layer or the MAC sublayer as the point through which ordinary data frames are injected into or extracted from the lower-layer communication technology.  \n   • Data Link Control SAP  \n     – Provided by the Connection Coordination Entity (the module that actually manages the life-cycle of the PLC link), because it needs to mediate matching, initialization and error-recovery operations.\n\n3. Relationship to Layers  \n   • Both SAPs sit “above” the MAC sublayer and “below” the Network layer (Layer 3).  But:  \n     – Data SAP is the “data-plane” interface: it carries user traffic.  \n     – Data Link Control SAP is the “control-plane” interface: it carries link management messages and status indications.\n\n4. Primitive Examples  \n   • Over the Data SAP (ETH SAP):  \n     – DATA-LINK-SEND.request(data-PDU) → lower layers will attempt transmission  \n     – DATA-LINK-SEND.confirm(success/failure) → informs Network layer of the outcome  \n     – DATA-LINK-RECEIVE.indication(new-data-PDU) → notifies Network layer of incoming payload  \n   • Over the Data Link Control SAP:  \n     – D-LINK_READY.indication(link-established) → tells higher layers they may start using the link  \n     – D-LINK_READY.indication(no-link) → tells higher layers the link has been lost  \n     – D-LINK_ERROR.request → instructs the lower layers to abort/re-initiate the link-setup process  \n\nIn short, whenever you want to move *user data* (IP packets, TCI frames, etc.) you go out over the Data SAP; whenever you want to manage or monitor the health of the underlying PLC link (bring it up, tear it down, detect errors, flow-control it, match EV to EVSE, etc.) you go out over the Data Link Control SAP.",
    "What is the difference between basic signaling and high-level communication?": "Basic signaling and high-level communication (HLC) both sit in an EV-to-EVSE communication system, but they serve very different roles and use very different technologies:\n\n1. Basic signaling  \n  • Defined by IEC 61851-1 (often called “IEC-1”) and referenced in ISO 15118-3.  \n  • Uses the single control-pilot conductor and simple PWM duty-cycles (5 %–96 %) plus discrete pilot states (A, B, C, D, X1, X2, etc.) to convey only the most fundamental information:  \n    – “Vehicle present / ready to receive current”  \n    – “Available maximum current” (via duty cycle)  \n    – “Start / stop charging”  \n  • Analog / on-off in nature, unidirectional or very limited bidirectional (e.g. counting B-C-B toggles for validation).  \n  • Always available and must be supported by every Mode 3/Mode 4 charger; used as a fallback (“basic charging mode”) if HLC-C fails.  \n  • No ability to carry richer data (metered values, dynamic grid constraints, identification keys, schedules, etc.).\n\n2. High-Level Communication (HLC)  \n  • Defined in ISO 15118-3 and related V2G standards (e.g. V2G3-M06-02, V2G3-M06-14).  \n  • Runs on top of basic signaling by embedding a PLC (HomePlug Green PHY or G3-PLC) modem in both EV and EVSE.  \n  • Supports a full message-based protocol stack (HLC-C mode) for bidirectional data exchange:  \n    – Vehicle and EVSE identification and authorization (EIM, Plug & Charge, ISO-2 message sets)  \n    – Dynamic grid information, pricing, charging profiles, state-of-charge updates  \n    – V2G services (bidirectional energy flow, smart charging/discharging schedules)  \n    – Sleep-mode negotiation, firmware updates, diagnostics  \n  • Messages include SLAC matching (CM_SLAC_*), attenuation characterization (CM_ATTEN_CHAR.*), validation (CM_VALIDATE.REQ/CNF), amplitude map exchange (CM_AMP_MAP.REQ), etc.  \n  • Without basic signalling you cannot establish or maintain the safety-critical pilot; HLC simply rides in parallel to provide all the “intelligence.”\n\nIn short:  \n  – Basic signaling is a low-level, single-wire pilot-line scheme for rudimentary charging control (current limits, connection state).  \n  – High-level communication is a full digital, bidirectional protocol (typically over PLC) that enables advanced features: secure identification, dynamic grid management, V2G, Plug & Charge, diagnostics and more.",
    "What is the difference between MTC and PTC?": "The two components sit at different levels of the test architecture and have very different responsibilities:\n\n1. Role and Scope  \n  – Main Test Component (MTC)  \n   • Acts as the *test executive* or “test controller.”  \n   • Implements the TTCN-3 test configuration, orchestrates test steps, sends and receives protocol messages (SLAC, CmValidate, CmSlacMatch, CmAmpMap, PLCLinkStatus, etc.), computes verdicts.  \n   • Can be either an EVCC_Tester (when the System Under Test is an EVCC) or a SECC_Tester (when SUT is a SECC).  \n   • Drives the high-level conformance testing of the communication controller under test (protocol, data-link layer, SLAC, ISO 15118-3 behaviors).  \n\n  – Parallel Test Component (PTC)  \n   • Runs *in parallel* to the MTC but is subordinate to it.  \n   • Is purely a physical-layer/IEC 61851-1 pilot-signal monitor&stimulus entity.  \n   • Continuously observes and manipulates the control-pilot PWM signal (duty-cycle, frequency, voltage states) and the EIM authorization status.  \n   • Confirms physical state changes (e.g. State B transitions, valid duty-cycle range, frequency range) and reports success/failure of EIM authorization back to the MTC.  \n\n2. Ports and Interfaces  \n  – MTC  \n   • Maps and uses ports like pt_SLAC_Port (for SLAC message exchange), pt_HAL_61851_Port (to drive the control-pilot line), pt_HAL_61851_Internal_Port (to read analog pilot-line state), etc.  \n   • Controls low-layer data-link processing (power-line communication link status, attenuation-characterization procedures) through those ports.  \n\n  – PTC  \n   • Has its own pt_HAL_61851_Internal_Port (and possibly HAL_61851_Listener_Port) mapped to the same physical pilot line, but uses it only to *observe* or *stimulate* PWM states in lock-step with the MTC’s test script.  \n   • Does not run the TTCN-3 test configuration itself—its sole purpose is to monitor or change the physical control-pilot signal in accordance with IEC 61851-1.  \n\n3. Responsibilities  \n  – MTC  \n   • Sequences protocol exchanges (e.g. CM_VALIDATE_REQ/CNF, CM_SLAC_PARM_REQ/CNF, CM_SLAC_MATCH_REQ/CNF).  \n   • Triggers attenuation-characterization GoodCase procedures, calculates average attenuation, manages timers (e.g. TT_match_sequence, TP_EVSE_avg_atten_calc).  \n   • Aggregates verdicts for conformance.  \n\n  – PTC  \n   • Implements the IEC 61851-1 Pilot Test Controller functions (V2G5-027 to V2G5-030): change PWM state condition, adjust valid duty-cycle and frequency ranges, process incoming EIM status (V2G5-034), inform MTC of EIM-authorization outcome.  \n   • Exercises the physical interface: toggles PWM states, measures voltages, confirms the EVSE/EV reaction on the pilot line.  \n\n4. Hierarchy and Interaction  \n  – The MTC *creates* or *spawns* the PTC as a parallel actor when a test scenario requires physical-layer stimulus or monitoring.  \n  – The PTC runs throughout the test case to watch for EIM or PWM-state events, and it calls back into the MTC to signal success/failure when those events occur.  \n  – At no point does the PTC itself drive protocol-level messages—those always originate from the MTC.  \n\nIn short:  \n  • The Main Test Component is your *TTCN-3 test controller* for upper-layer protocol conformance (SECC/EVCC behavior, SLAC, PLC link, ISO 15118-3).  \n  • The Parallel Test Component is your *physical-layer pilot-signal controller*, continuously observing or manipulating the IEC 61851-1 control-pilot PWM and EIM status in parallel to the MTC’s protocol tests."
}