{
    "What is the system architecture of Vehicle-to-Grid?": "[ISO-3] defines requirements applicable to layer 1 and layer 2, including V2G standardized service primitive interface, according to the OSI layered architecture. \\nLayer 3 to layer 7 is specified in [ISO-2]",
    "What is HPGP?": "HPGP stands for HomePlug Green PHY.\\nDetails can be found in the HomePlug Green PHY specification.",
    "What is SLAC?": "In the process of matching EV and EVSE, the EV determines which counterpart EVSE nodes are available and which one is the right one to connect to through signal strength measurement. SLAC is the signal strength measurement method to be used.\\nDuring the SLAC process, the EVSE measures the attenuation of the signal coming from the EV for different groups of frequencies and reports the signal strength back to the EV. Based on the reports, the EV determines the EVSE which is connected in a direct way.\\nSLAC stands for Signal Level Attenuation Characterization, which is the protocol to measure the signal strength of a signal between HomePlug Green PHY stations. \\nDetails can be found in Annex A HomePlug Green PHY on control pilot line.",
    "What is Logical Network?": "Logical Network refers to a set of low-layer communication stations which use the same network key. The type of network key used is NMK.\\nOnly members of the same logical network are able to exchange encrypted payload data and are visible for each other on higher layers. Different logical networks might exist on the same physical media at the same time and are typically used for network segmentation. A logical network is defined for layer 2.",
    "What is CCo?": "CCo stands for Central Coordinator, which is the manager of a HomePlug Green PHY network\\nThe low-layer communication module on the EVSE side shall be configured in order to always be the CCo.\\nThe low-layer communication module on the EV side shall be configured in order to never become the CCo.",
    "What is the difference between Data SAP and Data link control SAP?": "There are two interfaces from data link layer to higher layers: Data SAP and data link control SAP.\\nData SAP is the service access point that defines the interface between layer2 and layer3((e.g. IPv6)) for exchange of v2g-related payload. The data SAP is the ETH SAP, which is completely covered by the [HPGP]. \\nThe data link control SAP provides link status information, error information, control functionality and is located between the connection coordination and higher layers.",
    "What is the difference between basic signaling and high-level communication?": "The high-level communication is used in addition to the basic signalling in order to enable a bidirectional communication and offer additional features.",
    "What is the difference between MTC and PTC?": "MTC stands for main test component, which is  the single test component in a test component configuration responsible for creating and controlling parallel test components and computing and assigning the test verdict. The MTC always contains a TTCN‐3 test configuration and delimits the lifeline during test execution.\\nPTC stands for parallel test component, which is the test component created by the main test component.",
    "What is ATS?": "ATS stands for Abstract Test Suite, which is test suite composed of abstract test cases. ATS contains capability tests which checks if the observable capabilities of the SUT are in accordance with the static conformance requirements defined in ISO 15118‐3, and behavior tests which examines an implementation as thoroughly as is practical over the full range of dynamic conformance requirements defined in ISO 15118‐3 and within the capabilities of the SUT.",
    "What is TSS?": "TSS stands for test suite structure, which is a complete set of test cases, possibly combined into groups or modules (e.g. for use cases or domains like AC, DC charging), that are necessary to perform conformance testing for a given SUT. ",
    "What is EIM?": "EIM is External Identification Mean (as defined in ISO 15118-1)",
    "What is CM_SLAC_PARAM.REQ?": "CM_SLAC_PARM.REQ is the MME through which the EV broadcasts the parameters to be used for the signal strength measurement sequence in the matching process before the signal strength measurement starts.",
    "What is CM_SLAC_PARAM.CNF?": "CM_SLAC_PARM.CNF is the MME through which any unmatched EVSE which receives CM_SLAC_PARM.REQ responded to the request from EV.",
    "What is CM_START_ATTEN_CHAR.IND?": "None",
    "What is CM_MNBC_SOUND.IND?": "CM_MNBC_SOUND.IND is the MME through which the EVSE calculates the attenuation.",
    "What is CM_ATTEN_CHAR.IND?": "Based on these M-SOUNDS, all potential EVSEs calculate the signal strength and send back the measurement result by means of the CM_ATTEN_CHAR.IND message.",
    "What is CM_ATTEN_CHAR.RSP?": "In the process of signal strength measurement, all potential EVSEs calculate the signal strength based on the M-SOUNDS, and send back the measurement result by means of the CM_ATTEN_CHAR.IND message. Each CM_ATTEN_ CHAR.IND is confirmed by the EV by an individual CM_ATTEN_CHAR.RSP",
    "What is CM_ATTEN_PROFILE.IND?": "CM_ATTEN_PROFILE.IND is the MME through which groups of average attenuation are sent to EVSE Host.\\nThe ATTEN_PROFILE within the message CM_ATTEN_CHAR.IND shall be calculated by arithmetic mean of the ATTEN_PROFILE of the CM_ATTEN_PROFILE.IND of previous M-SOUNDS corrected by the attenuation of the receive path AttnRxEVSE.",
    "What is CM_VALIDATE.REQ?": "CM_VALIDATE.REQ is the MME through which the EV requests a validation process of the SLAC based matching after sending CM_ATTEN_CHAR.RSP. \\nThe  validation process is divided in two parts (step 1 and step 2)  consisting of a CM_VALIDATE.REQ and CM_VALIDATE.CNF each.",
    "What is CM_VALIDATE.CNF?": "CM_VALIDATE.CNF is the MME through which the EVSE  answers validation requests CM_VALIDATE.REQ from the EV in the matching validation process. The  validation process is divided in two parts (step 1 and step 2)  consisting of a CM_VALIDATE.REQ and CM_VALIDATE.CNF each. In step 1, CM_VALIDATE.CNF tells EV whether EVSE is ready for validation; in step 2, CM_VALIDATE.CNF sends the number of BCB-Toggles seen.",
    "What is CM_SLAC_MATCH.REQ?": "CM_SLAC_MATCH.REQ is the MME through which the EV requests the parameter for the logical network from the selected EVSE.",
    "What is CM_SLAC_MATCH.CNF?": "CM_SLAC_MATCH.CNF is the MME through which the EVSE responds the EV’s request of the parameter for the logical network. All parameters to be set to join the logical network of the EVSE is contained in CM_SLAC_MATCH.CNF.",
    "What is CM_SET_KEY.REQ?": "CM_SET_KEY.REQ is the MME through which the EV configures its low-layer communication module to the values from CM_SLAC_MATCH.CNF.\\nCM_SET_KEY.REQ is also used by EVSE to configure its low-layer communciation module to the NID and NMK values sent in CM_SLAC_MATCH.CNF at the latest after sending the CM_SLAC_MATCH.CNF. The configuration can also be done at any time before (e.g. after unplugging of a previous EV). ",
    "What is CM_SET_KEY.CNF?": "CM_SET_KEY.CNF is the MME through which the EV responds to CM_SET_KEY.REQ.",
    "What is CM_AMP_MAP.REQ?": "CM_AMP_MAP.REQ is the MME through which one host transmit the requested transmission power per carrier to the destination host to be included in its amplitude map calculation.\\nCM_AMP_MAP.REQ does not have any direct influence on the low-layer communication module transmission power, it is only used for information exchange.\\nCM_AMP_MAP.REQ sent from one host to the local low-layer communciation module causes the low-layer communication module to modify its transmission power.\\nAn amplitude map exchange can be initiated by an EV or an EVSE by sending a “CM_AMP_MAP.REQ” message.",
    "What is CM_AMP_MAP.CNF?": "CM_AMP_MAP.CNF is the MME through which one host confirm an amplitude map exchange.",
    "What is D-LINK_READY.indication?": "D-LINK_READY.indication(link established) is the primitive through which the communication node inform HLE that HLE’s binding process.\\nAs soon as the lower layers detect a data link after a wake-up, it shall send a D-LINK_READY.indication(link established) to HLE.\\nD-LINK_READY.indication(no link) is the primitive through which the low-layer communication module inform HLE that it leaves the logical network.\\nThe primitive is defined according to [ISO-2].",
    "What is D-LINK_TERMINATE.request?": "The D-LINK_TERMINATE.request requests lower layers to terminate the data link. Through D-LINK_TERMINATE.request, the HLE tells the communication node to leave the logical network. The low-layer communication module shall leave the logical network following the Clause “Leaving an AVLN” defined in the [HPGP], reset the NMK, and switch to matching state “Unmatched”. All parameters related to the current link shall be set to the default value and shall change to the status “Unmatched”.The primitive is defined according to [ISO-2].",
    "What is D-LINK_ERROR.request?": "The D-LINK_ERROR.request requests lower layers to terminate the data link and restart the matching process by a control pilot transition through state E to handle a loss of communication after the establishment of a data link. The primitive is defined according to [ISO-2].",
    "What is D-LINK_PAUSE.request?": "The D-LINK_PAUSE.request requests lower layers to enter a power saving mode. While being in this mode, the state will be kept to “Matched”.The primitive is defined according to [ISO-2]. With receiving a D-LINK_PAUSE.request, \\nthe EV shall change to control pilot state Bx. Unpowering the low-layer communication module is optional. The logical network parameter set shall be stored for continuing the data link after the sleeping phase.\\nthe EVSE shall switch to control pilot state X1 and may switch the low-layer communication module into low-power mode. The logical network parameter set shall be stored for continuing the data link after the sleeping phase."
}