{
    "iso3-image_0.png": "**Detailed Description of Figure A.2 — Sequence Chart of HomePlug Green PHY Matching Process (Part 2)**\n\nBelow is a step‐by‐step walkthrough of the second part of the SLAC (Signal-Level Attenuation Characterization) matching process, as shown in Figure A.2. The figure involves four principal entities:\n1. **EV Host**  \n2. **EV PLC Node** (the low‐layer communication module on the EV side)  \n3. **EVSE PLC Node** (the low‐layer communication module on the EVSE side)  \n4. **EVSE Host**  \n\nSeveral timers are used throughout (e.g., TT_match_response, TT_EVSE_match_MNBC, TT_EV_atten_results, etc.), and numerous message exchanges take place to coordinate the matching, measurement, validation, and eventual linking of the EV and the EVSE. The main goal is to ensure that the EV joins the EVSE’s HomePlug Green PHY network only if the correct EVSE is physically connected.\n\n---\n\n## 1. Entities Shown in the Figure\n\n1. **EV Host**  \n   • Triggers and manages part of the matching and SLAC processes on the vehicle side.  \n   • May also participate in the amplitude map exchange and final notifications to higher layers.\n\n2. **EV PLC Node**  \n   • The low‐layer communication module in the EV.  \n   • Sends/receives SLAC‐related messages (e.g., CM_SLAC_PARM.REQ), handles attenuation measurement steps (CM_START_ATTEN_CHAR.IND, CM_MNBC_SOUND.IND, CM_ATTEN_CHAR.RSP), and initiates validation or matching requests.\n\n3. **EVSE PLC Node**  \n   • The low‐layer communication module in the charging station.  \n   • Responds to the EV’s messages (e.g., CM_SLAC_PARM.CNF), performs attenuation measurements, and returns results (e.g., CM_ATTEN_CHAR.IND).  \n   • May also carry out a validation procedure upon EV requests and send final match confirmations.\n\n4. **EVSE Host**  \n   • Controls higher-level aspects on the EVSE side, including key sets (CM_SET_KEY.REQ) or other logic.  \n   • May provide triggers to begin or end the matching process.\n\n---\n\n## 2. High‐Level Flow Overview\n\nFigure A.2 shows the continuation of the overall HomePlug Green PHY matching process, focusing on:  \n- Attenuation measurements using M‐Sound messages and collecting CM_ATTEN_PROFILE.IND data.  \n- Final attenuation confirmations (CM_ATTEN_CHAR.IND and CM_ATTEN_CHAR.RSP).  \n- (Optionally) Validation steps (CM_VALIDATE) with possible BCB toggles.  \n- Network matching confirmation (CM_SLAC_MATCH).  \n- Key setting (CM_SET_KEY) on both sides.  \n- Detection of the link and optional amplitude map exchange (CM_AMP_MAPREQ and CM_AMP_MAPCNF).  \n- Final “D_LINK_READY” notification to the higher layers once the link is established.\n\n---\n\n## 3. Detailed Step‐by‐Step Flow\n\nBelow, each arrow or step in the figure is described in sequence (from top to bottom):\n\n1. **Wait for Matching Process Start Trigger**  \n   - Both the EV side and the EVSE side wait internally until a trigger condition indicates that SLAC matching should begin.  \n   - Timers such as TP_EV_SLAC_init (for the EV) and TT_EVSE_SLAC_init (for the EVSE) are started.\n\n2. **EV PLC Node → CM_SLAC_PARM.REQ**  \n   - Once triggered, the EV PLC node sends a “CM_SLAC_PARM.REQ” broadcast request.  \n   - This request announces the EV’s parameters to potential EVSE nodes and includes a unique runID.\n\n3. **EVSE PLC Node → CM_SLAC_PARM.CNF**  \n   - An unmatched EVSE node that is ready replies with “CM_SLAC_PARM.CNF” to the EV’s broadcast.  \n   - This confirmation message includes details like M-Sound counts, a matching runID, and a time-out field (Time_Out) dictating how long the EVSE will receive M-Sounds.\n\n4. **Timers and Response Windows**  \n   - The EV uses TT_match_response to await CM_SLAC_PARM.CNF messages. If valid CNFs are received, it proceeds. Otherwise, it retries or declares failure after repeated timeouts.\n\n5. **EV PLC Node → CM_START_ATTEN_CHAR.IND** (multiple times)\n   - After the EV obtains a valid parameter confirmation, it waits for TP_match_sequence to expire, then begins attenuation characterization by sending “CM_START_ATTEN_CHAR.IND” messages in a short batch.  \n   - Each indicates the number of M‐Sounds to transmit (NUM_SOUNDS) and includes the runID.\n\n6. **EV PLC Node → CM_MNBC_SOUND.IND** (multiple times)\n   - Following its last “CM_START_ATTEN_CHAR.IND,” the EV sends a sequence of “CM_MNBC_SOUND.IND” messages C_EV_match_MNBC times (for example, 8 times).  \n   - A decrementing counter (Cnt) goes down with each M‐Sound message. The EV typically spaces these out with TP_EV_batch_msg_interval to avoid congestion.\n\n7. **EVSE PLC Node → CM_ATTEN_PROFILE.IND** (multiple times)\n   - While the EV is sending M‐Sounds, the EVSE may measure and aggregate the received signals. It can send multiple “CM_ATTEN_PROFILE.IND” messages back to the EV if necessary.  \n   - The EV receives these within TT_EV_atten_results.\n\n8. **EVSE PLC Node → CM_ATTEN_CHAR.IND**\n   - After collecting or averaging enough M‐Sounds, the EVSE compiles final attenuation data and sends “CM_ATTEN_CHAR.IND” to the EV.  \n   - This is typically triggered once TT_EVSE_match_MNBC expires and the EVSE finishes averaging.\n\n9. **EV PLC Node → CM_ATTEN_CHAR.RSP**\n   - Upon receiving the final attenuation characterization message, the EV responds with “CM_ATTEN_CHAR.RSP,” acknowledging the data.  \n   - At this point, the EV has the final measured attenuation and can decide whether the EVSE is indeed the physically connected one (i.e., “EVSE_FOUND,” “EVSE_POTENTIALLY_FOUND,” or “EVSE_NOT_FOUND”).\n\n10. **Optional Validation Phase**  \n   - If the EV determines it needs further certainty, it performs a validation step:  \n     1. **CM_VALIDATE.REQ (Step 1)** from EV to EVSE – the EV requests the EVSE’s readiness to do a BCB toggle validation on the control pilot.  \n     2. **CM_VALIDATE.CNF (Step 1)** from EVSE to EV – the EVSE states “Ready,” “Not Required,” “Not Ready,” or “Failure.”  \n     3. **BCB Toggle** – If the EVSE is “Ready,” the EV toggles the battery control block for a specific time.  \n     4. **CM_VALIDATE.REQ (Step 2)** from EV to EVSE – includes how long the EVSE should count toggles.  \n     5. **CM_VALIDATE.CNF (Step 2)** from EVSE to EV – indicates success/failure and includes the count of toggles.  \n   - The EV can confirm the physically linked EVSE if the toggles match the EV’s expectation.\n\n11. **EV PLC Node → CM_SLAC_MATCH.REQ**\n   - Once the EV is confident it has identified the correct EVSE, it sends “CM_SLAC_MATCH.REQ” to finalize the network join parameters.  \n   - This message includes MAC addresses, the runID, and other final matching fields.\n\n12. **EVSE PLC Node → CM_SLAC_MATCH.CNF**\n   - The EVSE acknowledges with “CM_SLAC_MATCH.CNF,” which supplies the EV with the NMK (network membership key) or other parameters needed for a private logical network.  \n   - Both sides now have the exact security and channel information.\n\n13. **EV PLC Node ↔ EV Host** and **EVSE Host**: Key‐Setting (CM_SET_KEY)\n   - The figure may show “CM_SET_KEY.REQ” from the EVSE Host to EVSE PLC node (or from the EV Host to the EV PLC node).  \n   - “CM_SET_KEY.CNF” confirms that the local low‐layer module is configured with the correct NMK.\n\n14. **Link Detected & TT_match_join**  \n   - Once the EV sets its own key, it attempts to join the EVSE’s logical network. If a link is detected within TT_match_join, the process proceeds. Otherwise, the EV or EVSE decides the matching has failed and may retry.\n\n15. **(Optional) Amplitude Map Exchange (CM_AMP_MAPREQ, CM_AMP_MAPCNF)**  \n   - If either the EV or the EVSE requests a reduced transmit power or localized notched carriers, it may initiate the amplitude map exchange.  \n   - “CM_AMP_MAP.REQ” is sent, followed by “CM_AMP_MAP.CNF.” If no amplitude map exchange is needed, this part is skipped.\n\n16. **Inform Higher‐Layer Entities**  \n   - Once the link is securely established, the final step is a “D-LINK_READY” indication to the higher‐layer entity (HLE) in both the EV and the EVSE. This notifies both that the HomePlug Green PHY link is active and ready for ISO 15118 application‐layer communication.\n\n---\n\n## 4. Relationships and Key Connection Points\n\n- **EV PLC Node ↔ EVSE PLC Node**:  \n  Almost all SLAC measurement messages flow between these two low‐layer communication modules. They exchange parameter sets, attenuation data, and matching confirmations.\n\n- **EV Host ↔ EV PLC Node**:  \n  The EV Host instructs or triggers the EV PLC node to start SLAC or to proceed with validation. It may also configure local amplitude maps or set keys.\n\n- **EVSE Host ↔ EVSE PLC Node**:  \n  The EVSE Host can command its low‐layer module to set a new key (e.g., CM_SET_KEY.REQ) or to confirm certain states. It also triggers the EVSE PLC node to respond after a successful matching.\n\n- **Timers**:  \n  Many timers appear in the sequence and govern when a node can give up, retry, or proceed to the next step. For example:  \n  - **TT_EVSE_SLAC_init**: Time for EVSE to listen for CM_SLAC_PARM.REQ after detecting state B.  \n  - **TP_match_sequence**: A performance time ensuring that the next request (e.g., CM_START_ATTEN_CHAR.IND) happens only after the prior response.  \n  - **TT_match_response**: Both EV and EVSE wait up to this duration for a particular response; if it times out, they may retry or declare a failure.  \n  - **TT_EV_atten_results**: EV’s time window to receive all CM_ATTEN_CHAR.IND.  \n  - **TT_EVSE_match_MNBC**: EVSE’s time window to collect M-Sound data and produce CM_ATTEN_CHAR.IND.  \n  - **TP_EV_batch_msg_interval**: Interval between consecutive messages in a batch (e.g., multiple CM_MNBC_SOUND.IND).  \n  - **TT_match_join**: Maximum time allowed for the newly provided NMK/NID to form a valid link.  \n  - **TT_amp_map_exchange**: Time for optional amplitude map request/response.  \n  - **TP_link_ready_notification**: Performance limit to notify HLE that the data link is established.\n\n---\n\n## 5. Concluding Notes\n\n- **Failure Handling**:  \n  If any node fails to receive the expected messages within the specified timers or if content is invalid (e.g., invalid runID or mismatch in message definitions), the matching may be retried until certain repetition counts are reached. Ultimately, if repeated attempts fail, the matching process ends in “Unmatched” state.\n\n- **Optional Validation**:  \n  The EV is free to skip the CM_VALIDATE steps if the signal strength measurement unambiguously identifies the EVSE. If the EVSE is “Busy” or “Not Ready,” the EV can either wait and retry or attempt matching with a different EVSE (if multiple stations were discovered).\n\n- **Amplitude Map Exchange**:  \n  This may or may not be used in every session. It is only performed if either side wants to restrict transmit power further. If performed, both sides finalize an amplitude map to ensure compliance with local regulations and minimal interference.\n\n---\n\n### Final Outcome\n\nBy the end of the sequence shown in Figure A.2, the EV has:  \n1. Exchanged parameters and measured attenuation with all potential EVSEs.  \n2. (Optionally) Validated the correct EVSE with BCB toggles.  \n3. Requested and received final matching data (NMK, NID).  \n4. Joined the logical network by setting keys.  \n5. Confirmed or skipped the amplitude map exchange.  \n6. Indicated to higher layers that the link is ready for powerline communication.\n\nAll these steps ensure that only the physically connected EVSE is selected, avoiding interference or incorrect pairing with other EVSE nodes on the same powerline network.",
    "iso3-image_1.png": "# Detailed Description of Figure 1 — Overview of [ISO‑0] in the ISO/IEC OSI Reference Model\n\nBelow is a comprehensive, step-by-step explanation of the diagram labeled **“Figure 1 — Overview of [ISO-0] in the ISO/IEC OSI reference model.”** Although this figure is not a traditional “flowchart” (with decision diamonds or arrows depicting process steps), it provides a layered architectural view of how the ISO 15118 standards align with the classic ISO/IEC Open Systems Interconnection (OSI) reference model. In the sections below, each labeled entity is identified, and its role and connections are described in detail.\n\n---\n\n## 1. Entities in the Figure\n\n1. **OSI layer 1 Physical**  \n2. **OSI layer 2 Data link**  \n3. **OSI layer 3 Network**  \n4. **OSI layer 4 Transport**  \n5. **OSI layer 5 Session**  \n6. **OSI layer 6 Presentation**  \n7. **OSI layer 7 Application**  \n8. **Vehicle-to-Grid communication**  \n9. **ISO 15118‑1**  \n10. **General information and use-case definition**  \n11. **ISO 15118‑2**  \n12. **Network and application protocol requirements**  \n13. **V2G standardized service primitive interface**  \n14. **ISO 15118‑3**  \n15. **Physical layer and Data link layer requirements**  \n16. **Figure 1 — Overview of [ISO‑0] in the ISO/IEC OSI reference model**  \n\n---\n\n## 2. Overall Structure of the Diagram\n\nThe figure is conceptually divided into three major sections (from bottom to top):\n\n1. **Lower Layers (OSI Layer 1 and 2)** – Represented by the ISO 15118‑3 standard.  \n2. **Intermediate Layer Boundary** – Indicated by the “V2G standardized service primitive interface,” which bridges ISO 15118‑3 with the higher-layer protocols.  \n3. **Higher Layers (OSI Layers 3 through 7)** – Represented by the ISO 15118‑2 standard for network and application-level communication, with references to ISO 15118‑1 for general concepts and use-case definitions.  \n\nWithin the big outer box labeled “Vehicle-to-Grid communication,” two standards are highlighted:\n- **ISO 15118-1** (covering general info and use-case definitions)\n- **ISO 15118-2** (covering network and application protocol requirements)\n\nAt the bottom, a second large box is labeled **ISO 15118-3** (covering physical and data link layer requirements). Between these two boxes, a horizontal band is labeled **V2G standardized service primitive interface**, indicating the interface boundary where higher-level protocols interact with physical and data link services.\n\n---\n\n## 3. Layer-by-Layer Description\n\n### 3.1 OSI Layer 1 (Physical)\n- **Name in Diagram**: “OSI layer 1 Physical.”  \n- **Role**: The physical layer is responsible for the transmission and reception of raw bitstreams over a physical medium—e.g., the actual cable or wireless medium used for communications.  \n- **Referenced Standard**: **ISO 15118‑3** covers the physical layer requirements, ensuring that electric vehicles (EVs) and charging stations (EVSEs) are interoperable at the physical signal level (e.g., Power Line Communication (PLC), electromagnetic compatibility requirements, etc.).\n\n### 3.2 OSI Layer 2 (Data Link)\n- **Name in Diagram**: “OSI layer 2 Data link.”  \n- **Role**: The data link layer establishes and terminates a connection between two physically connected nodes, handling error detection/correction and basic framing.  \n- **Referenced Standard**: **ISO 15118‑3** also covers the data link layer requirements (e.g., MAC addressing, PLC MAC layer specifics) to ensure a stable “low-layer” communication for Vehicle-to-Grid (V2G).\n\nBoth Layer 1 and Layer 2 appear inside the “ISO 15118‑3” box. They are the core focus of “Part 3” of the ISO 15118 series, which defines how signals and data frames are sent over the physical medium and how they link up into a standardized “pipe” for higher-layer messages.\n\n### 3.3 V2G Standardized Service Primitive Interface\n- **Name in Diagram**: “V2G standardized service primitive interface.”  \n- **Role**: This horizontal band sits between the physical/data link layers (bottom) and the upper layers (top). It serves as a boundary or interface that allows the protocols described in ISO 15118‑2 (network and application) to communicate with the lower-layer technology specified by ISO 15118‑3.  \n- **Importance**: It defines how services and primitives (e.g., data requests, acknowledgements, connection management) are exchanged between the data link layer and higher network/application layers. This is the main “handshake” region that ensures a consistent interface across potentially different hardware or firmware implementations.\n\n### 3.4 OSI Layer 3 (Network)\n- **Name in Diagram**: “OSI layer 3 Network.”  \n- **Role**: The network layer handles packet forwarding, including routing through intermediate routers. In the scope of V2G, it organizes data exchange at the IP layer (or other possible network-layer protocols).  \n- **Referenced Standard**: **ISO 15118‑2** is responsible for specifying how the network layer is used for V2G communication (e.g., IP addressing, transport selection requirements).\n\n### 3.5 OSI Layer 4 (Transport)\n- **Name in Diagram**: “OSI layer 4 Transport.”  \n- **Role**: Responsible for reliable or unreliable end-to-end transport of data (e.g., TCP/UDP). In V2G contexts, this layer ensures robust message delivery or streaming.  \n- **Referenced Standard**: Again, covered by **ISO 15118‑2**, which dictates how the transport layer interacts with the network layer and the session layer to support the V2G protocols.\n\n### 3.6 OSI Layer 5 (Session)\n- **Name in Diagram**: “OSI layer 5 Session.”  \n- **Role**: Helps manage and control the connections between applications, establishing, maintaining, and terminating communication sessions.  \n- **Referenced Standard**: Part of the **ISO 15118‑2** coverage, ensuring session-oriented capabilities (like initiating a charging session, exchanging messages for contract authorization, etc.).\n\n### 3.7 OSI Layer 6 (Presentation)\n- **Name in Diagram**: “OSI layer 6 Presentation.”  \n- **Role**: Ensures that data is in a usable format for the application layer—handling data encryption, serialization, and translation if necessary.  \n- **Referenced Standard**: **ISO 15118‑2** also governs how data representation and encoding details (e.g., XML, EXI) are handled in the V2G messages.\n\n### 3.8 OSI Layer 7 (Application)\n- **Name in Diagram**: “OSI layer 7 Application.”  \n- **Role**: Closest to the end-user; in V2G, it describes the application-level data exchanges that facilitate use-cases like contractual identification, pricing, charging profiles, and energy management.  \n- **Referenced Standard**: **ISO 15118‑2**. All relevant V2G messages (e.g., request/response for charging schedules, authentication, or payment) are part of the application layer protocols described here.\n\n### 3.9 Vehicle-to-Grid Communication (Top-Level Box)\n- **Name in Diagram**: “Vehicle-to-Grid communication.”  \n- **Role**: This large box depicts the entire scope of “V2G” communication from an OSI perspective—covering from network to application aspects. It conceptually contains two key parts:\n  1. **ISO 15118‑1** (General information and use-case definition)  \n  2. **ISO 15118‑2** (Network and application protocol requirements)\n\n  Where **ISO 15118‑1** sits within the conceptual top-level because it outlines overarching use-cases and contexts, while **ISO 15118‑2** addresses the technical details of how to implement them in the network/application layers.\n\n### 3.10 ISO 15118‑1\n- **Name in Diagram**: “ISO 15118‑1.”  \n- **Caption**: “General information and use-case definition.”  \n- **Role**: Provides the foundational concepts, goals, and use-case scenarios for V2G. It does not specify OSI layers per se but offers the background and scope for the more technical parts (‑2 and ‑3).\n\n### 3.11 ISO 15118‑2\n- **Name in Diagram**: “ISO 15118‑2.”  \n- **Caption**: “Network and application protocol requirements.”  \n- **Role**: Defines how the EV and EVSE communicate over the network and at the application layer to fulfill the use-cases that ISO 15118‑1 describes. It covers OSI layers 3 through 7 and ensures interoperability in message structuring, security, authentication, plug-and-charge features, etc.\n\n### 3.12 ISO 15118‑3\n- **Name in Diagram**: “ISO 15118‑3.”  \n- **Caption**: “Physical layer and Data link layer requirements.”  \n- **Role**: Specifies the physical mediums, data link procedures (PLC modems, MAC sublayer specifics), and any hardware-level interoperability requirements, including timing, cable specifications, electromagnetic compatibility, etc. This standard ensures that EV and EVSE can transmit signals reliably so that higher-layer protocols (ISO 15118‑2) can function as intended.\n\n---\n\n## 4. Relationship and Connections\n\n1. **ISO 15118‑3 → V2G Standardized Service Primitive Interface**  \n   - ISO 15118‑3 defines how data is physically encoded/decoded, then delivered to the next layer via service primitives. The horizontal interface states exactly how these data units or service requests move up to the higher layers.\n\n2. **V2G Standardized Service Primitive Interface → ISO 15118‑2**  \n   - The standardized interface allows protocols defined in ISO 15118‑2 to operate independently of the underlying physical or data link technologies. This separation provides modularity and helps different hardware implementations remain compatible as long as they abide by the same interface primitives.\n\n3. **ISO 15118‑2 → OSI Layers 3–7**  \n   - ISO 15118‑2 “lives” across the network, transport, session, presentation, and application layers, specifying how messages are constructed, routed, and validated for end-to-end V2G communication.\n\n4. **ISO 15118‑1 → Overall**  \n   - Although not explicitly mapped to a single OSI layer, ISO 15118‑1 supplies the conceptual building blocks—e.g., high-level use-cases, general requirements, and definitions—that shape the services needed in layers 1–7.\n\n5. **Vehicle-to-Grid Communication (Overall)**  \n   - Encompasses the end-to-end scenario, from the physical signals (lowest layer) to the application messages (highest layer). The entire diagonal or wave-like region that includes ISO 15118‑1 and ISO 15118‑2 is conceptually the V2G communication “stack,” reliant upon the hardware-level foundation described by ISO 15118‑3.\n\n---\n\n## 5. How the Diagram “Flows”\nWhile not a classic procedural “flowchart,” the layering suggests an upward flow of data and messages:\n\n1. **Physical/Layer 1**: Signals on the cable or PLC.  \n2. **Data Link/Layer 2**: Data is framed, and local links are established error-free.  \n3. **V2G Service Interface**: The boundary where well-defined primitives let higher-level protocols control or request link services.  \n4. **Network, Transport, Session, Presentation, Application (Layers 3–7)**: Actual V2G messages, session management, security, and application data (e.g., payment, contract ID exchange).  \n\nEach standard (ISO 15118‑1, ISO 15118‑2, and ISO 15118‑3) is responsible for a portion of this layered model. ISO 15118-1 sets the context, ISO 15118-2 handles the upper communication layers, and ISO 15118-3 ensures the physical/data link reliability.\n\n---\n\n## 6. Key Takeaways for Engineers\n\n- **Separation of concerns**: The figure neatly distinguishes the physical/data link requirements (ISO 15118‑3) from the network-to-application requirements (ISO 15118‑2), with ISO 15118‑1 providing conceptual underpinnings.  \n- **Modularity**: By adhering to the OSI layering, manufacturers can update physical or data link implementations without forcing redesign of higher-layer protocols, as long as the standardized service interface remains intact.  \n- **Interoperability**: Each layer’s compliance ensures that an EV from one vendor can communicate effectively with an EVSE from another vendor—covering everything from signal waveforms to network addresses to high-level billing transactions.\n\n---\n\n**Figure 1** thus serves as a foundational reference for how the entire V2G communication stack (layers 1 through 7) aligns with the separate parts of the ISO 15118 standard, illustrating the scope and boundary of each part in the OSI model. The layered design promotes a robust, flexible, and interoperable charging ecosystem for electric vehicles and charging infrastructure.",
    "iso3-image_10.png": "## 1. **Overview**\n\nFigure B.3 (labeled “G3-PLC communication stack”) shows the overall architecture of the G3-PLC technology as it applies to ISO 15118-3. It depicts the **physical layer** at the bottom, the **data link layer** in the middle, and exposes two key **Service Access Points** (SAPs) at the top:\n- **Data link data SAP** (left side at the top)  \n- **Data link control SAP** (right side at the top)\n\nWithin the data link layer, several sub-layers and management entities are shown, including the **6LoWPAN convergence layer**, **IEEE Std 1901.2™ – 2013 G3-PLC OFDM MAC layer**, and corresponding management blocks. The right edge labels the entire stack as **3G-PLC Technology**.\n\nBelow is a detailed breakdown of each entity in the diagram and how they connect or interact.\n\n---\n\n## 2. **Entities in the Figure**\n\n1. **Physical layer**  \n   - Shown at the bottom of the stack and labeled:  \n     “IEEE Std 1901.2™ – 2013 G3-PLC OFDM PHY layer.”  \n   - Handles transmission and reception of raw data over the physical transmission medium (the pilot wire in a vehicle-to-grid context).  \n   - Managed by the **PHY Mgt** block on the right side.\n\n2. **IEEE Std 1901.2™ – 2013 G3-PLC OFDM MAC layer**  \n   - Sits directly above the Physical layer.  \n   - Implements a CSMA/CA access method and defines the framing, addressing, and error-check mechanisms for data link communications.  \n   - Managed by the **MAC Mgt** block on the right side.\n\n3. **IEEE Std 1901.2™ – 2013 Annex B**  \n   - Labeled inside the 6LoWPAN-related box.  \n   - Refers to the additional specification details relevant to 6LoWPAN operation in G3-PLC networks.\n\n4. **6LoWPAN convergence layer**  \n   - Encompasses four functional blocks:  \n     - **Fragmentation**  \n     - **Header compression**  \n     - **EAP PSK authentication**  \n     - **LowPAN bootstrap protocol**  \n   - Adapts IPv6-based packets over the G3-PLC MAC/PHY layers.  \n   - Provides the means to establish authentication (EAP-PSK), compress/fragment IP traffic, and handle the bootstrap procedures.  \n   - Managed by the **6LoWPAN Mgt** block.\n\n5. **Data link layer**  \n   - Shown on the left boundary of the large box that includes both the IEEE 1901.2 G3-PLC OFDM MAC layer and the 6LoWPAN convergence layer (IEEE Std 1901.2™ – 2013 Annex B).  \n   - Encompasses any functionality that operates between the physical layer and higher layers (e.g., network or transport).\n\n6. **Data link data SAP**  \n   - Positioned at the top-left.  \n   - An interface for exchanging data between higher layers and the data link layer.  \n   - Provides primitives such as:  \n     - DATA-LINK_SEND.REQ / DATA-LINK_SEND.CNF  \n     - DATA-LINK_RECEIVE.IND\n\n7. **Data link control SAP**  \n   - Positioned at the top-right.  \n   - An interface through which link control procedures are performed (e.g., error handling, link status checks, or coordination messages).\n\n8. **3G-PLC Technology**  \n   - Labeled along the right edge to denote that the physical and data link aspects of this diagram are part of the 3G-PLC (often referencing G3-PLC) stack technology.\n\n9. **6LoWPAN Mgt**  \n   - A management entity for operations specific to the 6LoWPAN convergence layer (e.g., configuring EAP-PSK, controlling bootstrap procedures, etc.).\n\n10. **MAC Mgt**  \n    - A management entity related to the MAC layer.  \n    - Manages MAC behaviors such as channel access parameters, security keys, and MAC-level configuration.\n\n11. **PHY Mgt**  \n    - Manages the physical layer (PHY).  \n    - Responsible for settings like modulation scheme parameters, automatic channel estimation, and frequency band usage.\n\n12. **Fragmentation**  \n    - A sub-function in the 6LoWPAN convergence layer.  \n    - Splits larger IPv6 packets into smaller fragments suitable for the underlying G3-PLC MAC layer if needed.\n\n13. **Header compression**  \n    - Another sub-function in the 6LoWPAN convergence layer.  \n    - Compresses IPv6, UDP, or TCP headers to reduce overhead on constrained PLC links.\n\n14. **EAP PSK authentication**  \n    - The Extensible Authentication Protocol–Pre Shared Key.  \n    - Used for secure authentication in the network association phase.\n\n15. **LowPAN bootstrap protocol**  \n    - A protocol within 6LoWPAN to help connect and configure new nodes in the PLC mesh or network environment.\n\n---\n\n## 3. **Connections and Relationships**\n\n- **Physical layer** ↔ **PHY Mgt**  \n  The OFDM PHY layer (IEEE Std 1901.2™ – 2013) is controlled/configured by the PHY management block, which sets physical transmission parameters.\n\n- **Physical layer** → **IEEE Std 1901.2™ – 2013 G3-PLC OFDM MAC layer**  \n  The MAC layer receives raw frames from the physical layer and adds addressing, channel-access rules, and error checking.\n\n- **MAC Mgt** ↔ **IEEE Std 1901.2™ – 2013 G3-PLC OFDM MAC layer**  \n  The MAC management entity controls or monitors MAC-related parameters (e.g., network IDs, security).\n\n- **IEEE Std 1901.2™ – 2013 G3-PLC OFDM MAC layer** → **6LoWPAN convergence layer**  \n  The MAC layer passes packets (frames) up to the 6LoWPAN layer, which then applies fragmentation, compression, etc.\n\n- **6LoWPAN Mgt** ↔ **6LoWPAN convergence layer**  \n  Provides configuration and management for the 6LoWPAN features such as EAP-PSK authentication, bootstrap, compression rules, and fragmentation.\n\n- **6LoWPAN convergence layer** → **Data link data SAP**  \n  Data that has been processed (fragmented/compressed/authenticated) can be handed to higher layers via the Data link data SAP using standardized primitives (DATA-LINK_SEND, DATA-LINK_RECEIVE, etc.).\n\n- **Data link control SAP**  \n  Offers a control and status interface to manage the link (e.g., link setup, teardown, status inquiries). It is conceptually connected to the modules in the data link layer (both MAC and 6LoWPAN) for controlling link behavior.\n\n- **3G-PLC Technology**  \n  The entire physical and data link stack is grouped under the 3G-PLC Technology label, indicating compliance with G3-PLC standards and specifications.\n\n---\n\n## 4. **Data Flow Summary**\n\nThough this diagram is a stack rather than a linear flowchart, we can summarize the logical “flow” of data:\n\n1. **PHY Layer →** Receives/transmits raw signals on the pilot wire (OFDM).  \n2. **MAC Layer →** Interprets/assembles frames over the PHY signals, applying CSMA/CA, encryption, and error checks.  \n3. **6LoWPAN Convergence →**  \n   - Applies fragmentation if a frame is too large.  \n   - Compresses headers to reduce overhead.  \n   - Authenticates nodes with EAP-PSK if required.  \n   - Uses LowPAN bootstrap to join the network.  \n4. **Data Link SAP (Data + Control) →**  \n   - Exposes services for upper layers to send/receive data (Data link data SAP).  \n   - Exposes link management and status control services (Data link control SAP).\n\nAll layers have corresponding management blocks (PHY Mgt, MAC Mgt, 6LoWPAN Mgt) that configure each layer for optimal operation. Ultimately, the stack ensures IPv6-based communication over power lines using G3-PLC.\n\n---\n\n## 5. **Key Takeaways**\n\n- **Figure B.3** illustrates how **G3-PLC** provides both **physical (PHY)** and **data link (MAC + 6LoWPAN)** functions in ISO 15118-3.  \n- **6LoWPAN** is essential for supporting IPv6, authentication, and efficient header handling (fragmentation/compression).  \n- **Data link SAP** interfaces (Data and Control) allow upper layers to send data or manage link status.  \n- **Management entities** (PHY Mgt, MAC Mgt, 6LoWPAN Mgt) coordinate each layer’s configuration and operational parameters.\n\nThis layered approach ensures a robust, standardized mechanism for vehicle-to-grid and related power line communication scenarios.",
    "iso3-image_11.png": "# Detailed Description of the Connection Coordination Flow Chart (Figure 3)\n\nBelow is a step-by-step explanation in **Markdown** format, intended to help engineers quickly understand every element and pathway in the flow chart. The chart corresponds to “Figure 3” in the ISO 15118‑3 documentation, specifically showing **AC EVSE** behavior supporting PnC (Plug and Charge) and EIM (External Identification Means), with the **matching process** not started before EIM completion, and the **5 % control pilot duty cycle** is applied after the vehicle plugs in.\n\n---\n\n## 1. Entities Overview\n\n**From the figure and key, these entities appear:**\n\n1. **Plug-in**  \n   - The event of connecting the EV’s inlet to the EVSE’s connector.\n\n2. **Re-init**  \n   - A restart of the session (without unplugging) by applying Control Pilot state E transition (often triggered by error handling).\n\n3. **X1 or X2 (5 %)**  \n   - Control Pilot (CP) state at 5 % duty cycle (or nominally “X1” if not yet stabilized).  \n   - NOTE 1: As indicated, CP state “X1” is allowed instead of “X2 (nom.)” per IEC‑3 Table 5.\n\n4. **X2 (5 % or nom.) \"Matched state\" and authorization OK**  \n   - A state signifying that the EV and EVSE have achieved a matched condition at CP state X2 (which can be 5 % or nominal duty cycle); authorization is validated.\n\n5. **EIM done & matching process not started**  \n   - A condition where EIM (External Identification Means) is completed, but the V2G “matching process” (high-level communication negotiation) has not yet begun.\n\n6. **E/F (0 %)**  \n   - A Control Pilot state indicating 0 % duty cycle. Typically used for error or re-initialization handling.\n\n7. **T_step_EF**  \n   - The time duration for which the system remains in control pilot states E or F (0 %), as required by certain error or transition handling.\n\n8. **X2 (nom.)**  \n   - Control Pilot state at the nominal duty cycle for AC charging (different from the 5 % duty cycle).\n\n9. **PnC**  \n   - “Plug and Charge,” meaning automatic identification/authorization of the EV without separate user action.\n\n10. **EIM**  \n   - “External Identification Means,” such as RFID or other manual authentication methods.\n\n11. **BC (Basic Charging)**  \n   - Charging controlled purely by IEC 61851‑1 signals (i.e., CP PWM duty cycle).  \n   - Represented in the flow chart as “BC” or “charging controlled by IEC 61851‑1.”\n\n12. **HLC‑C**  \n   - High‑Level Communication (HLC) for charging control, typically governed by the ISO 15118 V2G communication protocol.  \n   - This is shown as “HLC‑C” or “charging controlled by high-level communication.”\n\n13. **b) EIM w. BC**  \n   - A specific branch in the flow chart where EIM is used and the charging is performed with Basic Charging (IEC 61851‑1) once authorized.\n\n14. **c) EIM w/o BC**  \n   - A branch where EIM is used, but the charging control is done via High‑Level Communication (HLC‑C).\n\n15. **d) [IEC‑1] Charging**  \n   - A branch illustrating basic IEC 61851‑1 charging (without HLC‑C).  \n   - NOTE 2: Indicated in the figure that branch d) is for EVs not supporting HLC‑C.\n\n16. **V2G Setup finished**  \n   - The end of the V2G (Vehicle‑to‑Grid) high‑level communication setup. After this, power transfer can begin in the chosen mode (PnC, EIM w. BC, EIM w/o BC, or plain IEC 61851‑1).\n\n17. **Trigger condition**  \n   - Noted in the legend as the condition that prompts a transition in the flow (e.g., “Plug-in,” “Re-init”).\n\n18. **Possible procedure vs. Mandatory procedure**  \n   - The figure’s arrow styles:  \n     - Dotted Arrow = Possible procedure  \n     - Solid Arrow = Mandatory procedure\n\n---\n\n## 2. Key/Notes from the Figure\n\n- **“NOTE 1: CP state X1 is allowed instead of X2 (nom.) following [IEC‑3] (Table 5).”**  \n  This means that shortly after plug-in, the EVSE might momentarily apply CP state X1 before transitioning to X2(nom.) or X2(5 %).  \n- **“NOTE 2: Branch d) is for EVs not supporting HLC‑C.”**  \n  Some EVs are incapable of high-level communication for AC charging; in that case, they can only proceed with the basic IEC 61851‑1 method, shown in branch d).\n\n---\n\n## 3. Step-by-Step Flow Description\n\nBelow is the sequence of steps shown in the diagram, from left to right and top to bottom.  \n\n1. **Plug-in**  \n   - The EV is connected to the EVSE.  \n   - At this moment, the EVSE typically sets the Control Pilot to either **X1** or **X2 (5 %)**.\n\n2. **Initial CP State: X1 or X2 (5 %)**  \n   - According to the standard, the EVSE might start with a 5 % duty cycle to indicate a low-current or minimal power state.  \n   - **In parallel**, a “Re-init” action could also lead the CP state back to **X1 or X2 (5 %)** (this can happen if an error arises and the EVSE needs to reset the session without physically unplugging).\n\n3. **Two Parallel Paths Emerge**  \n\n   ### Path A – “Matched State” with Authorization (Top Branch)\n\n   3A. **X2 (5 % or nom.) \"Matched state\" and authorization OK**  \n       - If the EV and EVSE move quickly into a matched state at X2 (either 5 % or nominal), and the EV’s authorization is confirmed (for example, via **PnC** credentials automatically), then it proceeds as follows:\n\n   4A. **PnC**  \n       - This indicates “Plug and Charge.” The EVSE instructs high-level communication for finalizing charging parameters.\n\n   5A. **HLC‑C**  \n       - The EVSE and EV exchange ISO 15118 (V2G) messages. This is mandatory if using PnC in AC-charging with HLC.\n\n   6A. **V2G Setup finished**  \n       - Once the high-level communication successfully completes, the system is ready and can begin actual power transfer under the PnC agreement.  \n\n   *(End of Path A)*\n\n   ### Path B – EIM Done & Matching Not Started (Middle Branch)\n\n   3B. **EIM done & matching process not started**  \n       - The EIM process (e.g., scanning an RFID card) is finished, but the V2G “matching” session has not begun.  \n       - The EVSE transitions to an error or reset state on the Control Pilot:\n\n   4B. **E/F (0 %)**  \n       - The duty cycle is driven to 0 %. This is an error/reset state or a neutral state forcing the EV to stop momentarily.\n\n   5B. **T_step_EF**  \n       - The EVSE remains in CP state E or F for a required duration (T_step_EF). This wait is mandatory before re-enabling a normal charging state.\n\n   6B. **X2 (nom.)**  \n       - After T_step_EF, the EVSE sets the duty cycle to the nominal level (X2). This indicates an intent to supply standard AC current.  \n\n   From **X2 (nom.)**, we see three sub-branches:\n\n   - **b) EIM w. BC**  \n     7b. The “b)” label indicates “EIM with Basic Charging.” Once the system is at X2(nom.), the EV can start charging based solely on **IEC 61851‑1**.  \n     8b. **BC** is used (the PWM duty cycle signals the requested current).  \n     9b. **V2G Setup finished** (here, it effectively means no high-level comm is used for controlling power or has ended).  \n     10b. Charging proceeds with BC.\n\n   - **c) EIM w/o BC**  \n     7c. The “c)” label indicates “EIM without Basic Charging,” meaning the EV and EVSE do use **HLC‑C** (ISO 15118 high-level communication) to regulate charging.  \n     8c. **HLC‑C** is started. The standard’s V2G messages help orchestrate the charging session.  \n     9c. **V2G Setup finished.**  \n     10c. Charging now occurs under high-level communications, with EIM credentials having authorized it.\n\n   - **d) [IEC‑1] Charging**  \n     7d. The “d)” label references **IEC 61851‑1**-only charging. **NOTE 2** states that this branch is used by EVs that do **not** support HLC‑C.  \n     8d. The EVSE continues in Basic Charging mode with the nominal duty cycle on the Control Pilot.  \n     9d. The EV charges following **IEC 61851‑1** specifications.  \n\n   *(End of Paths B, b), c), and d) )*\n\n---\n\n## 4. Relationship and Connection of Entities\n\n- **Trigger conditions (“Plug-in” / “Re-init”)**: These conditions cause the CP state to go to **X1 or X2 (5 %)**. Re-init is typically an internal reset without physical disconnection.  \n- **Control Pilot States (X1, X2, E, F)**: These represent distinct duty-cycle signals sent by the EVSE to the EV.  \n- **EIM or PnC**:  \n  - **PnC** automatically authorizes the EV if it supports the ISO 15118 plug-and-charge certificate exchange.  \n  - **EIM** involves an external user action (e.g., RFID card).  \n- **HLC‑C** vs. **BC**:  \n  - **HLC‑C** stands for “High‑Level Communication Controlled” charging, governed by ISO 15118 messages.  \n  - **BC** stands for “Basic Charging,” governed by IEC 61851‑1 duty cycle alone.  \n- **Matching Process**: The step where the EV and EVSE exchange messages to confirm that advanced communication is possible and desired (via HLC‑C). In the figure, if that process is “not started” before EIM is done, the EVSE is shown forcing a short E/F(0 %) state before rejoining the nominal X2.  \n- **T_step_EF**: A defined time to remain at 0 % duty cycle for transitional or error recovery steps.  \n\n---\n\n## 5. Extras / Notes\n\n- **NOTE 1**: The chart allows CP State X1 as an alternative to X2(nom.) in early or transitional steps, aligning with IEC standards.  \n- **NOTE 2**: The “d)” branch specifically caters to EVs that cannot handle ISO 15118 high-level communication. They will remain in IEC 61851‑1 basic mode.  \n- **Mandatory vs. Possible Procedures**:  \n  - Solid arrows are steps that must occur according to the standard if the conditions apply.  \n  - Dashed or dotted arrows are possible transitions depending on EV/EVSE capabilities.  \n\n---\n\n### Summary\n\nIn essence, **Figure 3** shows how an **AC EVSE** can handle different authorization scenarios (**PnC** or **EIM**) and how the system either proceeds into **high-level communication** (HLC‑C) or stays with **basic IEC 61851‑1** charging. The *matching process* for ISO 15118 can begin once the EV is at a suitable control pilot state (X2). If the EV does **not** support HLC‑C, it will remain at nominal duty cycle X2 and proceed with basic AC charging (branch **d**). For an EV that does support HLC‑C, it can either do **PnC** (branch **a**) or **EIM** (branches **b/c**) with high-level communication or fallback to BC if HLC fails.\n\nAll paths ensure that the EVSE and EV coordinate on CP states (X1, X2, E/F with 0 %) to manage transitions (like resets or error states) before the final charging mode is achieved.",
    "iso3-image_12.png": "# Detailed Description of Figure A.9 — Example of Sequence Chart of Matching Process Error Handling\n\nBelow is a step-by-step explanation, in **Markdown** format, of the sequence chart labeled **Figure A.9**. This figure illustrates the **SLAC (Signal-Level Attenuation Characterization) matching process** between an Electric Vehicle (EV) and an Electric Vehicle Supply Equipment (EVSE), with emphasis on how errors and timing constraints are handled. The diagram shows four main entities:\n\n1. **EV Host**  \n2. **EV PLC node** (the EV’s low-layer communication module)  \n3. **EVSE PLC node** (the EVSE’s low-layer communication module)  \n4. **EVSE Host**\n\nVarious **timers** and **messages** govern the retry logic, confirmations, and triggering conditions. The goal is to establish a matched communication link (sometimes referred to as SLAC matching). This specific figure highlights an error-handling example where the EV repeatedly sends parameter requests until the EVSE’s low-layer module is fully ready.\n\n---\n\n## 1. Entities and Their Roles\n\n1. **EV Host**  \n   - Coordinates overall EV-side communication and initiates the SLAC matching sequence upon detecting plug-in or other triggers.  \n   - Waits for “Matching Process Start Trigger” to begin SLAC parameter exchange.\n\n2. **EV PLC Node**  \n   - The EV’s low-layer communication module that actually sends and receives SLAC messages (e.g., CM_SLAC_PARM.REQ).  \n   - Interacts with the EVSE’s PLC node to configure parameters, confirm matching status, and finalize the SLAC link.\n\n3. **EVSE PLC Node**  \n   - The EVSE’s low-layer communication module. It responds to requests from the EV PLC node and eventually sends a CM_SLAC_PARM.CNF message when ready.  \n   - May be initially “asleep” or in a booting state, causing the EV to resend parameter requests if no confirmation is received.\n\n4. **EVSE Host**  \n   - Oversees the EVSE side, can send key-setting commands to the EVSE PLC node (CM_SET_KEY.REQ) and receives confirmations (CM_SET_KEY.CNF).  \n   - Also waits internally for the “Matching Process Start Trigger” before instructing the low-layer module to proceed with matching.\n\n---\n\n## 2. Key Messages in the Chart\n\n- **CM_SET_KEY.REQ** / **CM_SET_KEY.CNF**  \n  Used by the EVSE Host to set cryptographic or network keys in the EVSE PLC module. A request/confirmation exchange (REQ/CNF) ensures keys are established before proceeding.\n\n- **CM_SLAC_PARM.REQ**  \n  A crucial request message sent by the EV PLC node. It initiates or retries the SLAC parameter negotiation. Several of these may be sent if the EVSE PLC node is not yet ready to respond.\n\n- **CM_SLAC_PARM.CNF**  \n  The confirmation message that the EVSE PLC node sends in response to a valid CM_SLAC_PARM.REQ. Once this is received by the EV PLC node, the matching process can progress to the next stage (or conclude if final parameters are agreed).\n\n---\n\n## 3. Timers and Their Significance\n\nThe figure shows multiple timers or time parameters in the margin. Each timer serves a distinct purpose in error handling and retry logic during matching:\n\n- **TP_EV_SLAC_init**:  \n  A time parameter on the EV side. Indicates when the EV is ready to start sending SLAC messages after plug-in or initialization.\n\n- **TT_EVSE_SLAC_init**:  \n  A similar timeout event on the EVSE side, signifying the EVSE’s readiness for the matching process (or that it is still booting).\n\n- **TT_match_response** and **TP_match_response**:  \n  Both appear repeatedly in the message sequence. They govern how long each side waits for a response to SLAC messages (e.g., how long the EV will await a CM_SLAC_PARM.CNF before resending a CM_SLAC_PARM.REQ).  \n  - “TT_match_response” often indicates a test timeout or internal handling.  \n  - “TP_match_response” can denote a performance or protocol timer requiring the message to be answered within a specific duration.\n\n- **TT_matching_rate**:  \n  A wait time before restarting the SLAC matching process after a failure or no-response scenario. Used to avoid flooding the network with frequent retry attempts.\n\n- **TT_matching_repetition**:  \n  The maximum duration or repetition window during which multiple matching attempts can be retried before concluding that matching has failed entirely.\n\n- **TT_match_sequence** / **TP_match_sequence**:  \n  These timers define or bound the overall sequence of matching attempts. “TT_match_sequence” may mark the final stage of the matching process or the cutoff for the entire exchange sequence.\n\n---\n\n## 4. Step-by-Step Flow of the Sequence Chart\n\n### A. Initial Key-Setting on the EVSE Side\n\n1. **EVSE Host → EVSE PLC node: CM_SET_KEY.REQ**  \n   - The EVSE Host sends a request to configure or set security/network keys on the EVSE PLC node.\n\n2. **EVSE PLC node → EVSE Host: CM_SET_KEY.CNF**  \n   - The EVSE PLC node confirms successful key setting back to the EVSE Host.  \n   - After this step, the EVSE side is (or soon will be) ready to exchange SLAC parameters, once the matching trigger event starts.\n\n### B. Waiting for Matching Process Start\n\n3. **EV Host**: “Wait for Matching Process Start Trigger”  \n   - On the EV side, the system is idle until the matching process is triggered (e.g., plug-in detected or higher-layer instruction).\n\n4. **EVSE Host**: “Wait for Matching Process Start Trigger”  \n   - Similarly, the EVSE Host is also waiting for the condition to begin the SLAC matching process.\n\n5. **TP_EV_SLAC_init** and **TT_EVSE_SLAC_init**  \n   - These timers are activated (or at least monitored) to ensure both sides begin matching in a timely manner.  \n   - “TP_EV_SLAC_init” is often started on the EV side, while “TT_EVSE_SLAC_init” is tracked on the EVSE side.\n\n### C. Repeated SLAC Parameter Requests and Error Handling\n\n6. **EV PLC node → EVSE PLC node: CM_SLAC_PARM.REQ** (Attempt 1)  \n   - As soon as the EV is ready, it sends the first parameter request to the EVSE.  \n   - If the EVSE PLC node is not fully operational yet, no immediate response is given.\n\n7. **Timer Trigger: TT_match_response** or **TP_match_response**  \n   - The EV waits for a response from the EVSE PLC node within a defined time.  \n   - If no **CM_SLAC_PARM.CNF** is received, the EV concludes the EVSE is not ready and may resend the request.\n\n8. **EV PLC node → EVSE PLC node: CM_SLAC_PARM.REQ** (Attempt 2, 3, …)  \n   - The EV PLC node continues sending CM_SLAC_PARM.REQ at intervals governed by **TT_match_response** (or **TP_match_response**).  \n   - Each attempt is followed by another wait period.  \n   - If the EVSE PLC node remains unresponsive, the timer **TT_matching_rate** might also come into play to delay the next retry.\n\n9. **TT_matching_repetition**  \n   - This overarching timer is running in the background. It ensures the total number of attempts remains within a certain window.  \n   - If the EV times out on repeated attempts (and **TT_matching_repetition** expires), the process transitions to a “failed” state.\n\n10. **EV PLC node → EVSE PLC node: CM_SLAC_PARM.REQ** (Final Attempt)  \n    - Eventually, the EVSE PLC node is ready (i.e., has finished booting or is fully awake).\n\n11. **EVSE PLC node → EV PLC node: CM_SLAC_PARM.CNF**  \n    - At long last, the EVSE responds with the confirmation message.  \n    - Reception of **CM_SLAC_PARM.CNF** indicates that the EVSE PLC node has accepted the request parameters and has effectively “caught up” to the EV’s repeated attempts.\n\n### D. Conclusion of Matching Sequence\n\n12. **TP_match_sequence** and **TT_match_sequence**  \n    - As soon as the correct confirmation is received, the final matching sequence timers are observed.  \n    - Typically, this implies the SLAC parameter exchange has succeeded, or at least the matching process can progress to the next step in the standard (e.g., amplitude map exchange or final link readiness).\n\n13. **Matched State**  \n    - Once a valid exchange has completed, the link enters the “Matched” state (per the standard’s definitions).  \n    - At this point, no further **CM_SLAC_PARM** messages should be sent (per [V2G3-A09-118]) unless the process fails or restarts.\n\n---\n\n## 5. Relationships and Connections\n\n1. **Key Setting First, Then SLAC Matching**  \n   - The EVSE Host sets up keys on the EVSE PLC node before the matching process triggers.  \n   - This ensures that secure or correct network parameters are in place once the EV and EVSE attempt to exchange SLAC parameters.\n\n2. **Timers Govern Retrying and Error Handling**  \n   - Each **CM_SLAC_PARM.REQ** attempt has a corresponding timer (TT_match_response / TP_match_response). If no reply is received within that window, the EV resends.  \n   - Global repetition timers **TT_matching_repetition** and **TT_matching_rate** regulate how often and how many times the EV can resend these requests before declaring failure.\n\n3. **Confirmation Ends Parameter Repetition**  \n   - Once **CM_SLAC_PARM.CNF** arrives, the repeated attempts stop.  \n   - The EV and EVSE effectively coordinate to finalize the link parameters.\n\n4. **High-Level Wait States**  \n   - Both the EV Host and EVSE Host remain in a “Wait for Matching Process Start Trigger” state until preconditions (like plug-in or system readiness) are met.  \n   - Only after triggers and initial timers do the low-layer modules actually exchange messages.\n\n---\n\n## 6. Summary\n\nFigure A.9 demonstrates a **typical SLAC matching sequence** with a strong focus on **error recovery and timing**. The EV tries multiple times to initiate the parameter exchange, while the EVSE might be booting or unready to respond. Each repeated **CM_SLAC_PARM.REQ** is gated by **TT_match_response**. If the EVSE still does not confirm, the EV eventually retries but must obey the higher-level timers (**TT_matching_rate**, **TT_matching_repetition**). Ultimately, the EVSE PLC node becomes active, responds with **CM_SLAC_PARM.CNF**, and the process can conclude successfully within **TT_match_sequence**.  \n\nSuch a design ensures robust handling of real-world delays (e.g., EVSE boot times) and aligns with ISO 15118-3 requirements that define how an “Unmatched” state eventually transitions to “Matched,” or else leads to a matching failure if all retries are exhausted.\n\n---\n\n> **Note:** These timers, messages, and states are specified in ISO 15118-3 Annex A for HomePlug Green PHY communication over the vehicle’s control pilot line. The standard also provides additional constraints (e.g., amplitude map exchange in A.9.6) and states that no further SLAC messages shall be processed once a “Matched” state is achieved ([V2G3-A09-118]).",
    "iso3-image_13.png": "# Detailed Description of the Flow Chart (Figure 3)  \n\nBelow is a step-by-step explanation of the flow chart, including each key entity, the transitions between states, and how they relate to one another. This chart describes an AC EVSE (Electric Vehicle Supply Equipment) supporting different modes of charging, including High-Level Communication Charging (HLC-C) and Basic Charging (BC), under both Plug & Charge (PnC) and External Identification Means (EIM). \n\n---\n\n## 1. Entities Overview\n\n1. **Plug-in**  \n   The moment the EV is physically connected to the EVSE.\n\n2. **X1 or X2 (5%)**  \n   Indicates that upon plug-in, the Control Pilot (CP) can be in either state X1 or state X2 with a 5% duty cycle.  \n   • NOTE 1: According to IEC standards ([IEC‐3], Table 5), CP state X1 may be used for a brief period until the CP oscillator is switched on. If not using X1, then 5% duty cycle in X2 is used instead.\n\n3. **X2 (5%)**  \n   Shows the CP remains at 5% duty cycle while waiting for authorization or the start of the matching process.\n\n4. **“Matched state” and authorization OK**  \n   Once the EV and EVSE have established that the authorization (PnC or EIM) is successful, and the matching process (for high-level communication) is complete, the charging can proceed under HLC-C.\n\n5. **EIM done & matching process not started**  \n   An indication that External Identification Means is completed, but the matching process (to move to HLC-C) has not started. This situation might lead to remaining in a 5% duty cycle or transitioning to other states.\n\n6. **Re-init**  \n   A session restart without physically unplugging the EV (often triggered by an error or a control pilot transition to state E).\n\n7. **E/F (0%)**  \n   The control pilot is in an error or fault state (0% duty cycle). This typically happens if a fault or error has been detected, or if the system invokes a “re-init” procedure.\n\n8. **T_step_EF**  \n   The specific time duration the system remains in the E/F (0%) state (error handling) before transitioning back to a normal control pilot state.  \n   • T_step_EF is defined by the standard to allow proper reset/clearing of faults.\n\n9. **X2 (nom.)**  \n   The nominal duty cycle in control pilot state X2 (indicating readiness for normal or basic charging). When HLC-C is not active or is completed, the CP uses the nominal duty cycle instead of 5%.\n\n10. **HLC-C (charging controlled by high-level communication)**  \n    Indicates that charging (or “V2G Setup”) is controlled via ISO 15118 high-level messages. PnC or EIM with HLC-C will use this path.\n\n11. **BC (charging controlled by IEC 61851-1)**  \n    Basic charging mode (without high-level communication). This is allowed before or after the high-level communication session, or as a fallback if the EV does not support HLC-C.\n\n12. **V2G Setup finished**  \n    Signals that the high-level communication (ISO 15118) setup phase is completed.\n\n13. **a) PnC**  \n    Branch “a” indicates the Plug & Charge path where authorization and matching take place over the high-level communication interface.\n\n14. **b) EIM w. BC**  \n    Branch “b” is for External Identification Means with Basic Charging. The EVSE and EV proceed in a basic IEC 61851-1 manner once EIM is successful.\n\n15. **c) EIM w/o BC**  \n    Branch “c” is for an EVSE that supports EIM and HLC-C but does not do full BC fallback. The result is high-level communication (HLC-C) for charging.\n\n16. **d) [IEC-1] Charging**  \n    Branch “d” shows the fallback or default IEC 61851-1 charging for EVs that do not support HLC-C.  \n    • NOTE 2: This branch is specifically for EVs not supporting HLC-C.\n\n17. **Trigger condition**  \n    Marked by an open arrow outline in the key. It indicates a condition (like “Matched state,” “authorization OK,” or “Re-init”) that triggers a transition.\n\n18. **Possible procedure (dotted arrow)** versus **Mandatory procedure (solid arrow)**  \n    Per the chart key, certain steps are allowed/possible, whereas others are mandatory in this coordination sequence.\n\n19. **Refer to IEC 61851-1 Ed 3, A5**  \n    A reference pointing to further details in the IEC 61851-1 standard regarding nominal CP states and transitions.\n\n20. **NOTE 1**  \n    “CP state X1 is allowed instead of X2 (nom.) following [IEC-3] (Table 5, X1 state usage).” This clarifies that the EVSE may briefly apply X1 as an alternative to X2(nom.) in certain conditions.\n\n21. **NOTE 2**  \n    “Branch d) is for EVs not supporting HLC-C.” This clarifies that path “d” in the diagram applies only to vehicles that cannot handle high-level communication.\n\n---\n\n## 2. Flow of the Diagram (Step by Step)\n\nBelow is the logical progression from plug-in to charging, including all key points:\n\n1. **Plug-in**  \n   - The EV is physically connected to the EVSE (control pilot circuit becomes active).\n\n2. **Initial CP State (X1 or X2 at 5% duty cycle)**  \n   - Right after plugging in, the EVSE may apply either:  \n     • X1 (5%) briefly, or  \n     • X2 (5%) immediately.  \n   - This 5% duty cycle indicates a low-current pilot signal, often used when the matching process (for HLC-C) is not started yet or when PnC/EIM authorization has not completed.\n\n3. **Transition to X2 (5%)**  \n   - If X1 was used initially, the EVSE then transitions to X2 at 5% duty cycle.  \n   - At this point, the “V2G Setup” may finish if the EV and EVSE quickly reach the “matched state” and authorization is OK (PnC or EIM).\n\n4. **Check Authorization / Matching**  \n   - If the EVSE detects that the vehicle is in the “matched state” with authorization OK (e.g., PnC done successfully or EIM done successfully with HLC-C), the diagram shows branch **a)** for PnC.  \n   - Otherwise, if the EIM is done but the matching process has not started, the EVSE may hold the 5% duty cycle or move to handle basic charging.\n\n5. **Re-init Condition (Optional Error Handling)**  \n   - If an error arises before successful authorization, the EVSE (or EV) may force a “Re-init.”  \n   - “Re-init” triggers a transition to CP state **E/F (0%)**.\n\n6. **E/F (0%) State**  \n   - The EVSE remains in E or F at 0% duty cycle for a duration **T_step_EF**, allowing the system to reset or clear fault conditions.\n\n7. **Transition to X2 (nom.)**  \n   - After T_step_EF, the EVSE switches the control pilot to **X2 (nom.)**, the normal duty cycle for potential basic charging or high-level communication readiness.\n   - At this point, there are several possible (and mandatory) branches:\n\n   ### a) PnC  \n   - If “Matched state” and PnC authorization are confirmed, high-level communication (HLC-C) controls the charging session (marked as “V2G Setup finished”).\n\n   ### b) EIM w. BC (External Identification Means with Basic Charging)  \n   - If EIM is used and the EVSE is configured to allow BC fallback, the EV charges under IEC 61851-1 control.  \n   - The diagram labels this as “b) EIM w. BC” with a mandatory arrow to “BC” or to “HLC-C,” depending on the setup.\n\n   ### c) EIM w/o BC (External Identification Means without Basic Charging fallback)  \n   - The EVSE supports EIM, but does not provide a Basic Charging fallback. Instead, once authorized, the system proceeds to high-level communication (HLC-C).  \n   - Labeled “c) EIM w/o BC.”\n\n   ### d) [IEC-1] Charging (No HLC-C Support)  \n   - This is the simple IEC 61851-1 path for EVs **not** supporting high-level communication.  \n   - **NOTE 2** reminds us that branch “d)” is explicitly for EVs incapable of HLC-C.\n\n8. **V2G Setup Finished**  \n   - For cases (a) PnC and (c) EIM w/o BC, the EVSE can complete the “V2G Setup” (i.e., high-level communication is established), and the EV can start charging with HLC-C controlling the current.  \n   - For (b) EIM w. BC or (d) IEC 61851-1, the EV charges under basic control pilot rules (nominal duty cycle).\n\n---\n\n## 3. Relation and Connection of Entities\n\n1. **Control Pilot States (X1, X2, E/F)**  \n   - These states indicate the duty cycle signals from the EVSE to the EV.  \n   - X1 or X2 at 5% represents “limited pilot signal” while waiting for matching or authorization.  \n   - X2 (nom.) represents “normal pilot signal,” allowing higher charging current or standard communication.  \n   - E/F (0%) is the error or fault state, where no charging current is offered.\n\n2. **High-Level Communication (HLC-C) vs. Basic Charging (BC)**  \n   - HLC-C requires a matching process and an active ISO 15118 negotiation. Once authorized (PnC or EIM w/o BC), the EVSE and EV exchange communication messages to control charging.  \n   - BC is the fallback or simpler mode, controlled by IEC 61851-1 duty cycles. It is used if the EV does not support high-level communication or if the system transitions to a basic mode.\n\n3. **Authorization Paths**  \n   - **PnC (a)**: Fully automatic method with contract certificates (Plug & Charge).  \n   - **EIM (b, c)**: The user must apply some external identification, possibly an RFID card or other method.  \n   - If an EV does not support HLC-C, branch **d** is used.\n\n4. **Re-init / Error Handling**  \n   - “Re-init” indicates that the system restarts the session logic (without a physical unplug) by transitioning to E/F (0%) for a set time **T_step_EF**.\n\n5. **Notes and References**  \n   - **NOTE 1**: CP state X1 is equivalent in usage to X2 (nom.) for a limited timeframe, based on IEC 61851-1 guidelines.  \n   - **NOTE 2**: Branch (d) is specifically for vehicles not supporting HLC-C.  \n   - **Refer to IEC 61851‐1 Ed 3, A5**: For deeper details on the CP states and transitions, especially X1 vs. X2 usage.\n\n---\n\n## 4. Summary\n\n- The flow chart details how an EVSE handles an EV connection from plug-in through error conditions (Re-init/E/F) to different charging modes (PnC, EIM with or without BC, or pure IEC 61851-1).  \n- The fundamental distinction is between using high-level communication (HLC-C) under ISO 15118 or defaulting to basic IEC 61851-1 control (BC).  \n- The 5% duty cycle (X2 or X1) is used directly after plug-in for authorization and matching steps.  \n- Once “V2G Setup” is finished (PnC or EIM w/o BC), the EV can charge under high-level communication.  \n- If the EV does not support HLC-C, or if an error triggers re-init, the EVSE can revert to basic charging (nominal X2 duty cycle).\n\nBy following this step-by-step diagram, engineers can quickly discern the control pilot behavior at each phase of the charging process, helping them implement or troubleshoot ISO 15118-3–compliant AC charging scenarios.",
    "iso3-image_14.png": "## 1. **Entities Overview**\n\nBelow is a list of the key entities and notations shown in the figure, along with brief definitions or notes:\n\n1. **Plug-in**  \n   Indicates that the EV (Electric Vehicle) is physically connected to the EVSE (Electric Vehicle Supply Equipment).\n\n2. **Re-init**  \n   A trigger condition that implies re-initialization of the charging or communication process.\n\n3. **X1 or X2 (5%)**  \n   • These represent control pilot states after the EV is plugged in.  \n   • “X2 (5%)” often indicates a 5% duty cycle on the control pilot, meaning the EVSE is signaling a low current or limited mode.  \n   • “X1” is a control pilot state defined in certain IEC standards.  \n   • Per the note, CP state X1 is allowed instead of X2 (nominal) following [IEC-3] (Table 5).  \n   • “X1 is required by TS 62763” is an additional note found in the diagram.\n\n4. **X2 (5% or nom.)**  \n   Once communication or certain conditions are met, the control pilot can be set to either 5% duty cycle or its nominal (full) duty cycle. “Nominal” typically means a normal charging current limit.\n\n5. **EIM done & matching process started**  \n   “EIM” denotes External Identification Means. This label indicates that the EVSE has completed authentication/identification by external means, and a matching process for PnC (Plug and Charge) or other protocols has begun.\n\n6. **“Matched state” and authorization OK**  \n   A state where the EVSE and EV have successfully exchanged necessary authorization data (e.g., for PnC or EIM) and are ready to proceed with charging setup.\n\n7. **a) PnC**  \n   Indicates the pathway for charging using Plug-and-Charge under high-level communication (HLC). Shown as a dedicated branch labeled “a) PnC.”\n\n8. **b) EIM w/ BC**  \n   Indicates the path for charging with External Identification Means and “BC” (Basic Charging). The label “BC charging controlled by IEC 61851‑1” means this branch follows standard IEC 61851‑1 basic signaling without advanced high-level communication for energy/power negotiation.\n\n9. **c) EIM w/o BC**  \n   Another EIM branch without Basic Charging fallback (or “w/o BC”). In this diagram, the EV may still use HLC-C for control or complete the process differently.\n\n10. **HLC-C**  \n    Stands for “High-Level Communication – Control,” referring to an EV and EVSE communication interface governed by upper-layer protocols (per ISO 15118). The label “charging controlled by high-level communication” clarifies that the EV and EVSE negotiate charging parameters using a higher-level standardized protocol.\n\n11. **BC**  \n    “Basic Charging,” which follows IEC 61851‑1, uses only the PWM duty cycle on the control pilot to communicate available current, without additional data link layers.\n\n12. **V2G Setup finished**  \n    V2G (Vehicle-to-Grid) services are set up. This note indicates that the initialization (communication, authorization, and matching) is complete.\n\n13. **Possible procedure** (dashed arrow)  \n    Indicates that this path may occur under certain conditions but is not mandatory.\n\n14. **Mandatory procedure** (solid arrow)  \n    Indicates that this path must occur in the standard defined sequence.\n\n15. **Trigger condition** (arrow with open box)  \n    Highlights an external event or action that triggers a state transition, such as “Re-init.”\n\n16. **Note**  \n    “CP state X1 is allowed instead of X2 (nom.) following [IEC‑3].” This clarifies that certain EVSEs may use X1 in place of nominal X2 under IEC guidelines.\n\n\n## 2. **Flow of the Diagram**\n\nBelow is a step-by-step walk-through of the entire flow based on the figure:\n\n1. **Start: Plug-in**  \n   - The process begins with the EV being physically connected to the EVSE.  \n   - Immediately after plug-in, the control pilot can be in **X1** or **X2 (5%)**.  \n   - In some designs, the EVSE may initially apply **X1**, and in others, a 5% duty cycle (X2) is established.\n\n2. **Re-init (Optional Trigger)**  \n   - There is a possibility that a “Re-init” trigger occurs. If so, the system might revert to the initial condition of X1 or X2 (5%), effectively restarting the coordination process.\n\n3. **EIM Done & Matching Process Started**  \n   - When External Identification Means is completed (e.g., RFID authentication or another method) and the matching process (for user authorization or contract setup) begins, the EVSE may transition the control pilot state to either **X1** or **X2 (5% or nominal)**.\n\n4. **Proceed to X2 (5% or nominal)**  \n   - After EIM is done, the control pilot often shifts or remains at a recognized state, typically **X2** with either a restricted 5% duty cycle or the nominal duty cycle.  \n   - There is a note (in the diagram) specifying that the EVSE can apply X1 if needed (per TS 62763), but for most cases, X2 is used.\n\n5. **“Matched State” & Authorization OK**  \n   - Once the EVSE and EV have validated each other (e.g., cryptographic handshake, contract validation, or user identification is approved), they achieve a “matched state.”  \n   - This means that the EV is fully authorized to proceed with charging, and the system can complete the V2G communication steps.\n\n6. **Branching into Three Main Paths**  \n   - After reaching the matched/authorized state, the setup is effectively complete (noted by “V2G Setup finished”), and the diagram shows three branches:\n\n   **a) PnC**  \n   - Plug-and-Charge path that uses HLC-C (high-level communication). Charging is entirely controlled by ISO 15118 protocols over a high-level data link.  \n\n   **b) EIM w/ BC**  \n   - External Identification Means with Basic Charging. The EVSE and EV continue charging under IEC 61851‑1 basic pilot signaling (“BC”), but the overall session is still recognized as EIM-based. High-level communication (HLC-C) might be used for some coordination but the actual current control is handled by BC signals.  \n\n   **c) EIM w/o BC**  \n   - External Identification Means (with no basic charging fallback). The EV and EVSE rely on HLC-C for control once authorized. The current levels and charging details are governed purely by high-level communications.\n\n7. **V2G Setup Finished**  \n   - In each branch, once the matching and authorization steps are validated, the communication channel is established or not needed (depending on BC vs. HLC-C). The vehicle and EVSE are now in a position to deliver power under the correct protocol and policies. The note “V2G Setup finished” emphasizes the system is ready for energy transfer, time-based adjustments, or other V2G-related functions.\n\n8. **Note about X1 vs. X2**  \n   - If the EVSE chooses to apply CP state X1 (instead of X2 nominal) at certain times, this is allowed by IEC references, but typically X2 nominal is expected for normal charging readiness.  \n   - Additional references mention that X1 might be used temporarily or in certain compliance contexts (TS 62763).\n\nThroughout the flow, **solid arrows** denote **mandatory steps** specified by the standard, and **dashed arrows** denote **possible (optional or conditional) procedures** that may or may not occur, based on the EVSE’s capabilities or the local configuration.\n\n\n## 3. **Relationship and Connection of Entities**\n\n- **EVSE and EV**: The diagram revolves around their interaction—from the moment of plugging in to the completion of the V2G setup.  \n- **Control Pilot States (X1 or X2)**: These states define the electrical conditions on the control pilot line per IEC 61851‐1 or TS 62763. Either X1 or X2 (5% or nominal) signals the readiness and current capacity available to the EV.  \n- **HLC-C (High-Level Communication)**: Serves as a communication channel (ISO 15118) enabling advanced features like Plug-and-Charge (PnC) and dynamic negotiation of charging parameters.  \n- **BC (Basic Charging)**: Uses the simpler IEC 61851–1 PWM scheme. When the EVSE or EV is not using the advanced HLC, they fall back to BC for setting current limits (branch b) and (by extension) c).  \n- **EIM**: Provides user identification external to the vehicle (e.g., via RFID or smartphone). Once “EIM done,” authorization and matching processes can either continue or finalize for charging.\n\nIn summary, the flow chart details how an AC EVSE can coordinate multiple charging modes (PnC, EIM with BC, or EIM without BC):\n\n• It starts when the EV is plugged in (applying X1 or X2 at 5% duty cycle).  \n• Moves through user/contract authentication (EIM done, matching process).  \n• Transitions to a valid charging or matched state (X2 nominal or remain at 5% if needed).  \n• Finally splits into whichever method is supported or authorized—PnC (high-level comm) or EIM-based charging (either with or without BC).\n\nAll of these steps ensure the EV and EVSE establish the correct communication and power transfer settings before actual charging begins.",
    "iso3-image_15.png": "# Detailed Description of the Flow Chart\n\nBelow is a step-by-step description of the flow chart shown in the figure. The diagram illustrates an AC EVSE (Electric Vehicle Supply Equipment) supporting High-Level Communication Control (HLC‑C) with both “Plug & Charge” (PnC) and EIM (External Identification Means). It also shows where Basic Charging (BC) fits in the process. The important note here is that some EVSEs support both PnC and EIM, while others may only support one path. Additionally, Control Pilot (CP) states X1 or X2 govern the duty cycle used on the control pilot signal.\n\n---\n\n## 1. Entities Overview\n\n1. **Plug-in**  \n   The event where the EV is physically connected to the EVSE.\n\n2. **Re-init**  \n   A trigger condition indicating that the EVSE and/or EV re-initializes the communication or charging process.\n\n3. **CP State X1 (100%)**  \n   A control pilot state that can be active immediately after plugging in (100% duty cycle).  \n   – Note: “X1 is allowed instead of X2 (nom.) following [IEC-3] (Table 5, X1 state usage).”\n\n4. **CP State X2 (nom.)**  \n   A nominal control pilot state that is typically used once the EVSE begins its normal duty cycle configuration.\n\n5. **CP State X2 (5% or nom.)**  \n   A possibly reduced duty cycle (at 5%) or nominal duty cycle, used to signal and confirm matching/authorization states between the EV and EVSE.\n\n6. **“Matched state” and authorization OK**  \n   Indicates that the EV and EVSE have successfully “matched” each other’s communication requirements and that authorization to charge is confirmed.\n\n7. **EIM done & matching process started**  \n   After the External Identification Means is completed, the matching process (which checks that the EV and EVSE can communicate properly) begins.\n\n8. **V2G Setup finished**  \n   Denotes that the high-level Vehicle-to-Grid (V2G) communication setup is established (in other words, the communication handshake is complete).\n\n9. **HLC‑C**  \n   “High-Level Communication Control”: indicates charging that is controlled via ISO 15118 high-level messages.\n\n10. **BC**  \n   “Basic Charging” (controlled by IEC 61851‑1): a simpler control mechanism using the basic control pilot signals without advanced ISO 15118 communication features.\n\n11. **a) PnC**  \n   A branch of the process for “Plug & Charge,” whereby authentication and authorization can be done automatically via certificates exchanged over high-level communication.\n\n12. **b) EIM w/ BC**  \n   A branch indicating blended EIM with Basic Charging. Communication is still possible at a high level, but actual current or power levels may be regulated in a simpler manner (BC).\n\n13. **c) EIM w/o BC**  \n   A branch in which EIM is used, and the charging proceeds without Basic Charging fallback (or simply uses the high-level communication directly).\n\n14. **possible procedure** (dashed arrow)  \n   Indicates a pathway or step that is allowed but not strictly mandatory in every implementation.\n\n15. **mandatory procedure** (solid arrow)  \n   Indicates a step that is required per the standard or the scenario.\n\n16. **trigger condition** (block arrow)  \n   A condition or event that initiates a transition (e.g., “Re-init,” “EIM done,” etc.).\n\n17. **NOTE**  \n   “CP state X1 is allowed instead of X2 (nom.) following [IEC‑3] (Table 5, X1 state usage).”\n\n---\n\n## 2. Flow of the Diagram\n\nThe chart can be broken down into the following sequence:\n\n1. **Plug-in → X1 (100%)**  \n   - The EV is plugged in.  \n   - Initially, the control pilot may be in state X1 (100% duty cycle).  \n   - This step might be very brief or can remain active until the EVSE activates its control pilot oscillator.  \n   - Alternatively, some implementations go directly to X2 (nom.) or X2 (5%) shortly after plug-in.\n\n2. **EIM Done & Matching Process Started**  \n   - As soon as the EV is plugged in and recognized, the EVSE can begin the EIM procedure (if applicable).  \n   - Once EIM completes, the EVSE and EV can begin the matching process (confirming the EV is ready for high-level communication and/or basic charging).  \n\n3. **Transition to X2 (5% or nom.)**  \n   - The EVSE shifts the control pilot signal to a “5% or nominal” duty cycle.  \n   - This denotes that the system is seeking or has established a “matched state” and is checking authorization compatibility.\n\n4. **X2 (5% or Nom.) “Matched State” and Authorization OK**  \n   - At this point, the EV and EVSE have confirmed each other’s presence and authorization.  \n   - From here, the diagram specifies the main charging branches.\n\n5. **V2G Setup Finished**  \n   - The high-level communication (ISO 15118) or the matching for basic charging (IEC 61851‑1) is complete.  \n   - The system is ready to begin energy transfer, subject to the branch chosen (PnC or EIM).\n\n6. **Branches (After V2G Setup Finished)**\n   - **(a) PnC**  \n     1. The EV proceeds under the “Plug & Charge” mechanism.  \n     2. All further charging control is managed by HLC‑C (high-level communication).  \n     3. This path is mandatory if the EV and EVSE are both configured for PnC and the user wishes to use it.  \n\n   - **(b) EIM w/ BC**  \n     1. The EV chooses EIM for identification/authorization.  \n     2. The actual charging current (or power) is controlled primarily by Basic Charging (BC) signals per IEC 61851‑1.  \n     3. Meanwhile, the high-level communication (HLC‑C) can still provide additional status or monitoring as necessary, but the main control is BC.  \n\n   - **(c) EIM w/o BC**  \n     1. The EV also uses EIM for identification, but BC is not utilized.  \n     2. The charging is controlled directly by the high-level communication (HLC‑C).  \n\n7. **Re-init**  \n   - A trigger condition that resets the process if necessary (for example, if some error occurs or a new cycle starts).  \n   - This can bring the CP signal back to X1 (100%) or the sequence might revert to an earlier step.\n\n---\n\n## 3. Relation and Connection of Entities\n\n- **Control Pilot States (X1, X2)**  \n  - These states represent different duty cycle signals on the control pilot line in accordance with IEC 61851‑1.  \n  - X1 (100%) may appear at plug-in or during re-initialization.  \n  - X2 (nom.) or X2 (5% or nominal) typically indicates the EVSE is in an active state waiting for or confirming communication or charging readiness.\n\n- **HLC‑C and BC**  \n  - These represent two different control planes for charging.  \n    - **HLC‑C (High-Level Communication)** follows ISO 15118 protocols for advanced features (e.g., PnC, contract certificates).  \n    - **BC (Basic Charging)** follows the simpler IEC 61851‑1 approach using the control pilot’s duty cycle to modulate charging current.\n\n- **Trigger Conditions**  \n  - “EIM done & matching process started,” “Re-init,” or “Plug-in” are events that move the system from one state to the next.\n\n- **PnC and EIM**  \n  - **PnC (Plug & Charge)** relies on automatic certificate-based authorization over the HLC connection.  \n  - **EIM (External Identification Means)** typically uses RFID cards, credit cards, or other external methods to authorize charging.\n\n- **NOTE on CP State Usage**  \n  - The chart clarifies that an EVSE may operate in CP state X1 instead of X2 (nom.) for a short time upon plugging in, depending on the implementation and compliance with IEC rules.\n\n---\n\n## 4. Summary\n\nThis flow chart (often referenced in ISO 15118-3 and related IEC 61851-1 guidelines) illustrates how an AC charging session can be coordinated when both PnC and EIM options are available:\n\n1. EV is plugged in (CP state X1 or X2).  \n2. EIM completes (if used) and the matching/authorization process starts.  \n3. Control pilot transitions to a 5% or nominal duty cycle, indicating a “matched state.”  \n4. Authorization is confirmed (PnC or EIM).  \n5. V2G Setup finishes.  \n6. Charging proceeds under one of three branches:  \n   - (a) PnC (fully high-level)  \n   - (b) EIM with Basic Charging  \n   - (c) EIM with high-level communication only (no BC).  \n\nAt every step, the chart differentiates **mandatory** arrows (solid) from **possible** (dashed) ones, highlighting which state transitions might be optional under certain system configurations.\n\n---\n\n> **Important Note:**  \n> If an EVSE only supports EIM or only supports PnC, any unused branches in the diagram (e.g., BC or HLC‑C) need not be followed. The figure covers the “universal” scenario where both are supported and the matching process has already started when EIM is finished.",
    "iso3-image_16.png": "# Detailed Description of the Flow Chart\n\nBelow is a thorough, step-by-step explanation in markdown format, covering all entities, transitions, and notes shown in the figure.\n\n---\n\n## 1. Entities Overview\n\n1. **A**  \n   - Represents an initial state or entry point (before the EV is plugged in or any charging coordination begins).\n\n2. **Plug-in**  \n   - Indicates the action of connecting the EV to the EVSE (Electric Vehicle Supply Equipment).\n\n3. **Re-init**  \n   - Denotes a re-initialization step, potentially triggered if the system needs to restart the setup process.\n\n4. **X2 (nom.)**  \n   - Refers to the nominal Control Pilot (CP) state “X2” as defined in the IEC/ISO standards. This is typically the normal state for AC charging pilot signaling.  \n   - According to the NOTE, “CP state X1 is allowed instead of X2 (nom.) following [IEC-3] (Table 5, X1 state usage).”\n\n5. **X2 (5 % or nom.)**  \n   - A variant on the Control Pilot “X2” state, potentially signifying a reduced PWM duty cycle (e.g., 5% for low-level communication or nominal duty cycle).\n\n6. **b) EIM w. BC**  \n   - A branch indicating External Identification Means (EIM) with Basic Charging (BC).  \n   - “BC” (Basic Charging) is charging controlled by IEC 61851‑1.\n\n7. **c) EIM w/o BC**  \n   - Another branch indicating EIM but without Basic Charging. Here, charging is controlled by high-level communication (HLC-C).\n\n8. **d) [IEC-1] Charging**  \n   - Represents a standard IEC 61851‑1 charging process (basic “Mode 3” charging), labeled as [IEC‑1] in the figure.\n\n9. **Trigger condition**  \n   - A condition or event that causes the transition from one control pilot state or step to another.\n\n10. **HLC-C**  \n    - High-Level Communication – Configuration (or simply High-Level Communication for Charging).  \n    - Indicates that the charging process is coordinated through advanced communication protocols (ISO 15118 / DIN 70121).\n\n11. **BC**  \n    - Basic Charging.  \n    - Charging controlled purely by the IEC 61851‑1 “Mode 3” protocol, without high-level comms.\n\n12. **V2G Setup finished**  \n    - A status showing that all necessary Vehicle-to-Grid (V2G) high-level communication steps or matching processes have completed successfully.\n\n13. **NOTE**  \n    - Provides an additional standard-specific note:  \n      “CP state X1 is allowed instead of X2 (nom.) following [IEC-3] (Table 5, X1 state usage).”\n\n14. **Possible procedure** (represented by dashed arrows)  \n    - Indicates paths or transitions that may occur depending on the EVSE/EV implementation but are not strictly mandatory by the standard.\n\n15. **Mandatory procedure** (represented by solid arrows)  \n    - Indicates paths or transitions that must occur to meet the standard requirements.\n\n16. **Refer to IEC 61851‑1 Ed. 3, A.5**  \n    - This reference points to a specific subclause in IEC 61851‑1 Edition 3, Annex A.5, which further explains or clarifies the CP states.\n\n17. **Key**  \n    - A legend/guide to the flowchart’s symbols and lines (possible/mandatory procedures, trigger conditions, etc.).\n\n---\n\n## 2. Flow of the Diagram (Step by Step)\n\n1. **State A (Idle/Pre-Connection)**  \n   - The dotted line labeled “possible procedure” leads to the circle marked “A,” showing that the system may start in this idle state or arrive here after a previous cycle.\n\n2. **Transition to “Plug-in” or Re-init**  \n   - From state “A,” two possible (dotted) paths can occur:  \n     1. **Plug-in**: The user connects the EV to the EVSE.  \n     2. **Re-init**: Some systems may need to reset, reinitialize, or re-attempt the procedure.\n\n3. **Arrival at X2 (nom.)**  \n   - Once plugged in or re-initialized, the EVSE sets the control pilot to “X2 (nom.)” (or “X1” if the NOTE is applicable). This is indicated by the solid arrow (mandatory procedure) leading to “X2 (nom.).”\n\n4. **Branch from X2 (nom.)**  \n   - At “X2 (nom.),” the chart shows multiple possible paths depending on whether high-level communication (HLC-C) or basic charging (BC) is being used, and whether External Identification Means (EIM) is required:\n\n   a) **From X2 (nom.) → X2 (5 % or nom.) with HLC-C → b) EIM w. BC**  \n      - If EIM is used with Basic Charging, then after V2G setup completion, the system references HLC-C for controlling the process. The duty cycle on the pilot might switch to “5 % or nominal,” and the EVSE is in an EIM mode with BC.  \n      - “BC” then handles charging under IEC 61851‑1.\n\n   b) **From X2 (nom.) → X2 (5 % or nom.) with HLC-C → c) EIM w/o BC**  \n      - Similar to the above, but if Basic Charging is not utilized, the EV/EVSE rely solely on high-level communication. The flow indicates “V2G Setup finished,” leading to EIM without BC.\n\n   c) **From X2 (nom.) → X2 (nom.) → d) [IEC-1] Charging**  \n      - If high-level communication is not used or not requested, the diagram references the standard IEC 61851‑1 charging process directly. This path also indicates that at some point after “X2 (nom.),” the EV goes into normal AC charging according to [IEC-1].\n\n5. **V2G Setup Finished**  \n   - Whenever HLC-C is invoked, the arrow from “HLC-C” shows “V2G Setup finished,” confirming that the vehicle-to-grid communication handshake is complete.\n\n6. **Reference to IEC 61851-1 Ed. 3, A.5**  \n   - The flow returns to “X2 (nom.)” with an accompanying note referencing IEC 61851‑1 for further details on pilot-state transitions.\n\n7. **NOTE**  \n   - The flow chart includes a note at the bottom clarifying that **CP state X1** may be used in place of **X2 (nom.)** if IEC-3 (Table 5) X1 state usage is applicable. This might occur in certain EVSE/EV configurations.\n\n---\n\n## 3. Relation and Connection of Entities\n\n1. **Control Pilot States (“X2(nom.)” or “X2(5% or nom.)”)**  \n   - These states define the level of duty cycle on the control pilot signal, crucial for indicating charging readiness, EIM usage, or high-level communication readiness.\n\n2. **HLC-C (High-Level Communication)**  \n   - When invoked, it coordinates the charging session (e.g., V2G features, advanced authorization, dynamic control). The flow chart clearly shows transitions that involve HLC-C lead to “V2G Setup finished” before actual charging can begin.\n\n3. **BC (Basic Charging)**  \n   - The simpler IEC 61851‑1–based control method, either used alone ([IEC-1] path) or in conjunction with EIM (b) EIM w. BC).\n\n4. **EIM w. BC vs. EIM w/o BC**  \n   - EIM (External Identification Means) can be combined with basic signaling or purely high-level communications. The diagram shows these two distinct branches:  \n     - **b) EIM w. BC:** EIM authentication plus IEC 61851‑1.  \n     - **c) EIM w/o BC:** EIM authentication and purely HLC-based control.\n\n5. **Trigger Conditions**  \n   - The arrows labeled with trigger conditions indicate transitions that depend on completing setup steps (e.g., “V2G Setup finished” or successful EIM). They show how the system might jump from “X2(nom.)” to “X2(5% or nom.)” or remain at “X2(nom.)” for traditional IEC 61851‑1 charging.\n\n---\n\n## 4. Additional Notes & References\n\n- **NOTE on CP state X1**:  \n  “CP state X1 is allowed instead of X2 (nom.) following [IEC-3] (Table 5, X1 state usage).” Depending on the EVSE implementation, the initial pilot state right after plug-in may be X1 rather than X2(nom.).\n\n- **IEC 61851-1 Ed. 3, A.5**:  \n  Additional details for CP signal definitions, pilot states, and the behavior in normal or reduced pilot duty cycles can be found in Annex A.5 of the third edition of IEC 61851‑1.\n\n- **High-Level Communication**:  \n  Typically refers to ISO 15118 (PnC, Plug-and-Charge) or DIN 70121-based solutions that enable advanced negotiation, payment handling, and bidirectional (V2G) features.\n\n- **Basic Charging**:  \n  Follows the simple IEC 61851‑1 conduction-based control pilot methodology without advanced communication.\n\n---\n\n### Conclusion\n\nThis flow chart depicts how an AC EVSE supporting high-level communication (HLC-C) and/or basic charging (BC) transitions through its control pilot states and procedures once an EV is plugged in (or re-initialized). The diagram includes multiple branches for External Identification Means (EIM) with or without BC, as well as a direct [IEC-1] charging path. Each step—plug-in, re-init, moving from A state to X2(nom.), optionally switching to X2(5% or nom.), completing V2G setup, and beginning charging—corresponds to specific control pilot and communication states. The note clarifies that X1 can stand in for X2(nom.) in certain implementations per IEC-3.",
    "iso3-image_17.png": "# Detailed Description of Figure 8 — Connection Coordination Seq 6: DC EVSE with PnC and EIM\n\nBelow is a detailed, step‑by‑step explanation of the flowchart in **Figure 8**, entitled **“Connection coordination Seq 6: DC EVSE with PnC and EIM.”** Three distinct scenarios (branches) are shown:  \n1. (a) PnC (Plug and Charge)  \n2. (c) EIM with EIM after plug‑in  \n3. (c) EIM with EIM before plug‑in  \n\nEach branch illustrates how the control pilot states, re‑initialization events, and **V2G (Vehicle‑to‑Grid) setup** are coordinated when using a DC Electric Vehicle Supply Equipment (EVSE).\n\n---\n\n## 1. Entities Overview\n\nBelow is a list of key entities and labels as they appear in the figure:\n\n1. **Key**  \n   - Explains the meaning of arrow types:  \n     - “possible procedure” (dashed arrow)  \n     - “mandatory procedure” (solid arrow)  \n   - Indicates “HLC‑C” refers to “charging controlled by high‑level communication.”\n\n2. **Plug‑in**  \n   - The physical action of connecting the DC charging connector to the vehicle.\n\n3. **X1 or X2 (5%)**  \n   - Denotes a control pilot state.  \n   - In DC charging context, a 5 % PWM duty cycle can be used to indicate specific conditions (e.g., waiting for authorization or identification).\n\n4. **X2 (5%)**  \n   - Another notation of the control pilot state specifically at 5 % duty cycle.  \n   - Sometimes the chart transitions from “X1 or X2 (5%)” to a clearly indicated “X2 (5%)” step.\n\n5. **Re‑init (Re‑initialization)**  \n   - An event where the system re‑initializes communication or restarts the handshake procedure.\n\n6. **V2G Setup started** and **V2G Setup finished**  \n   - These indicate the high‑level communication handshake between the EV and the EVSE for vehicle‑to‑grid functionality.  \n   - “V2G Setup started” means the handshake begins.  \n   - “V2G Setup finished” means the handshake completes successfully.\n\n7. **HLC‑C** (High‑Level Communication ‑ Control)  \n   - Represents charging control via high‑level communication protocols (as defined in ISO 15118).\n\n8. **PnC (Plug and Charge)**  \n   - A method of automatically identifying and authorizing an EV for charging, using ISO 15118’s “Plug and Charge” feature.\n\n9. **EIM (External Identification Means)**  \n   - A method or profile for identification of the EV user through an external means (e.g., RFID, app, or other mechanism). In some scenarios, EIM is performed before physically plugging in, while in others it occurs after the plug‑in event.\n\n10. **(a) PnC** and **(c) EIM**  \n   - Labels on the figure to differentiate which scenario is shown in each branch.\n\n11. **possible procedure** (dashed arrow)  \n   - Steps that may or may not occur, depending on system configuration or user action.\n\n12. **mandatory procedure** (solid arrow)  \n   - Required steps that must happen in a given scenario.\n\n---\n\n## 2. Flow of the Diagram\n\n### 2.1 Top Branch — (a) PnC Scenario\n1. **Plug‑in**  \n   - The driver (or automated system) physically connects the DC charging cable to the vehicle.  \n2. **X1 or X2 (5%)**  \n   - Immediately after plug‑in, the control pilot may be at state X1 or X2 with a 5 % duty cycle, indicating that the EVSE is awaiting identification and/or handshake.  \n3. **Transition to X2 (5%)**  \n   - The system (EV and EVSE) settles at a 5 % duty cycle for further communication.  \n4. **V2G Setup started**  \n   - High‑level communication begins (ISO 15118 protocol handshake).  \n5. **V2G Setup finished**  \n   - The handshake completes successfully. The system is now ready for controlled charging.  \n6. **HLC‑C**  \n   - The ongoing charging session is controlled by high‑level communication (“HLC‑C”).  \n7. **Final Arrow to “PnC”**  \n   - The diagram labels this entire scenario under “(a) PnC,” emphasizing that Plug and Charge identification was used.\n\n### 2.2 Middle Branch — (c) EIM Scenario (EIM after Plug‑In)\n1. **Plug‑in**  \n   - The operator connects the vehicle to the DC charger.  \n2. **X1 or X2 (5%)**  \n   - Immediately sees the control pilot in a 5 % duty cycle state, awaiting identification or handshake.  \n3. **Transition to X2 (5%)**  \n   - The control pilot stabilizes at X2 (5 %).  \n4. **V2G Setup started**  \n   - The vehicle‑to‑grid communication handshake is initiated.  \n5. **V2G Setup finished**  \n   - The handshake concludes successfully.  \n6. **HLC‑C**  \n   - Charging is now under high‑level communication control.  \n7. **Final Arrow to “c) EIM”**  \n   - The scenario is labeled “(c) EIM,” indicating that the system uses an external identification means.  \n   - Notably, the figure suggests that the EIM steps occur in or after the plug‑in event (rather than beforehand).\n\n### 2.3 Bottom Branch — (c) EIM Scenario (EIM before Plug‑In)\n1. **EIM**  \n   - External identification means is carried out **before** physically plugging in the vehicle.  \n2. **X1 or X2 (5%)**  \n   - The EVSE (or user interface) is in a state where it allows external ID, possibly at a 5 % duty cycle without the EV physically connected.  \n3. **Plug‑in**  \n   - The user then plugs in the vehicle.  \n4. **X1 or X2 (5%)**  \n   - Once again, the control pilot is at 5 % duty cycle after plug‑in, still coordinating identification if needed.  \n5. **Re‑init**  \n   - The system triggers a re‑initialization of the communication if required (for example, if the plug‑in event occurred after some EIM steps).  \n6. **V2G Setup started**  \n   - The vehicle and EVSE begin the ISO 15118 handshake.  \n7. **X2 (5%)**  \n   - The control pilot is confirmed at X2 with a 5 % duty cycle while the V2G communication is in progress.  \n8. **V2G Setup finished**  \n   - Handshake completes; the EV and EVSE are ready for managed charging.  \n9. **HLC‑C**  \n   - High‑level communication is actively controlling the charging session.  \n10. **Final Arrow to “c) EIM”**  \n   - Again, labeled “(c) EIM,” but this time with the identification finished **before** the plug‑in event.\n\n---\n\n## 3. Relationship and Connection of Entities\n\n- **“Plug‑in”** is the physical action that introduces the vehicle to the EVSE. In two of the branches (top and middle), EIM/PnC is effectively happening right after or during plug‑in. In the bottom branch, **EIM** occurs **before** the user physically connects the vehicle.  \n- **“X1 or X2 (5%)”** stands for specific control pilot states. The 5 % duty cycle often indicates a waiting or authorization phase. The chart consistently shows these states around the plug‑in and re‑init events.  \n- **“V2G Setup started”** and **“V2G Setup finished”** encapsulate the ISO 15118 handshake. Once V2G setup finishes, the charger transitions to **HLC‑C** (high‑level communication control).  \n- **“Re‑init”** can happen if the system needs to restart or re‑establish the communication sequence for any reason (for instance, if the user performed EIM prior to plug‑in).  \n- **“PnC”** is one type of identification method; **“EIM”** is another. Figure 8 illustrates how a DC EVSE can handle both PnC and EIM in multiple possible sequences.\n\n---\n\n## 4. Key Takeaways\n\n1. **Multiple Identification Methods:** The figure highlights that DC charging can be initiated with either PnC or EIM (or both), and the sequence of EIM can vary (before or after plug‑in).  \n2. **Control Pilot States (X1/X2 at 5 %):** The 5 % duty cycle is a critical indication that the system is in a hold or handshake‑awaiting state.  \n3. **V2G Setup Flow:** Each branch confirms that once the vehicle is plugged in and identification is complete (via either PnC or EIM), the V2G communication handshake starts, finishes, and hands over to **HLC‑C** for managing the charging.  \n4. **Re‑init Step:** Illustrates that if the sequence is interrupted or the vehicle or EVSE requires a fresh handshake (e.g., after an EIM step), they re‑initialize the communication before proceeding with V2G Setup.  \n\nBy following these flow steps, engineers and implementers can quickly understand how a DC EVSE (supporting ISO 15118) handles both **PnC** and **EIM** identification methods under different timing scenarios.",
    "iso3-image_18.png": "# Detailed Description of Figure 10 — EV Point of View (Matching Process)\n\nBelow is a step-by-step walkthrough of the flowchart. The diagram illustrates how an Electric Vehicle (EV) determines the correct Electric Vehicle Supply Equipment (EVSE) connection (i.e., “matching”) based on discovery, signal strength measurements, possible validation, and ultimately setting up or failing to set up a data link.\n\n---\n\n## 1. List of Key Entities in the Figure\n\n1. **Entering matching process**  \n   - Represents the beginning of the procedure once the EV is ready to identify which EVSE it is physically connected to.\n\n2. **Discovery of the connected communication nodes**  \n   - The EV discovers all communication nodes (EVSEs) detected on the physical link.\n\n3. **Signal strength measurement**  \n   - The EV measures signal strength metrics from all discovered communication nodes.  \n   - “Signal Strength Measurement is a value range indication within the matching process.”\n\n4. **Signal strength analysis**  \n   - The EV analyzes the measured signal strength to determine how strongly the EVSE’s signals are received.\n\n5. **Low signal attenuation**  \n   - Indicates a strong signal measurement.  \n   - If the analysis confirms a single strong connection, the result can be “EVSE_FOUND.”\n\n6. **Ambiguous result (multiple EVSE’s, uncertain signal strength)**  \n   - The EV sees more than one possible candidate or uncertain measurement.  \n   - Proceeds with the interim status “EVSE_POTENTIALLY_FOUND.”\n\n7. **High signal attenuation**  \n   - Indicates a weak signal.  \n   - If the analysis indicates no suitable EVSE, the result is “EVSE_NOT_FOUND.”\n\n8. **Result is “EVSE_FOUND”**  \n   - The outcome that the EV confirms exactly one matching EVSE based on the signal measurement.\n\n9. **Result is “EVSE_POTENTIALLY_FOUND”**  \n   - The outcome that the EV sees a possible match but cannot fully confirm. A validation step might be needed.\n\n10. **Result is “EVSE_NOT_FOUND”**  \n    - The outcome that the EV determines no valid EVSE is connected.\n\n11. **Declared result is “EVSE_FOUND” / “EVSE_POTENTIALLY_FOUND” / “EVSE_NOT_FOUND”**  \n    - Refers to the EV deciding or declaring the final outcome after possibly applying use-case-based rules.  \n    - For “EVSE_POTENTIALLY_FOUND,” the EV may treat that result as either “EVSE_FOUND” or “EVSE_NOT_FOUND,” depending on scenario.\n\n12. **optional**  \n    - Indicates that certain paths (e.g., additional validation) might be skipped according to the configuration or use-case definition.\n\n13. **Validation of matching decision**  \n    - An optional or necessary process (depending on the result and the system requirements) to confirm physically that the EV is indeed connected to the intended EVSE.  \n    - Can involve “BCB-Toggle” sequences on the control pilot line if the discovery result was ambiguous.\n\n14. **Validation result? (found / not found)**  \n    - After attempting validation, the EV either confirms or rejects the EVSE.  \n    - If confirmed → proceed to network setup.  \n    - If rejected → proceed to “next EVSE” or declare no link.\n\n15. **Remaining unvalidated EVSE?**  \n    - If more than one EVSE was discovered and not yet validated, the EV can continue validating in sequence.\n\n16. **next EVSE**  \n    - The EV moves to another candidate EVSE and repeats the validation step.\n\n17. **Setup logical network**  \n    - If the EV is satisfied with the discovered/validated EVSE, it sets up the logical (data link) communication network with that EVSE.\n\n18. **Data link established?**  \n    - Checks whether the EV has successfully established the data link (i.e., the communication session and all necessary transport layers).\n\n19. **Call D-LINK_READY.IND (Link established)**  \n    - Indicates to higher-layer entities (HLE) that a data link is set up (matching is successful).  \n    - From here, upper layers continue the binding process outlined in ISO 15118-3.\n\n20. **Call D-LINK_READY.IND (No link)**  \n    - Indicates that no valid data link is available (matching has failed).  \n    - The process can exit, and higher layers are notified that no link was established.\n\n21. **Exit matching process with success / failure**  \n    - Final outcome: the EV is either matched or not matched to an EVSE.\n\n22. **NOTE**  \n    - “Error handling for Matching Process is not shown in this figure. See A.9.8.”  \n\n---\n\n## 2. Flow of the Diagram (Step by Step)\n\n1. **Entering matching process**  \n   The EV transitions into the matching phase (often triggered by a control pilot transition to an active charging state).\n\n2. **Discovery of the connected communication nodes**  \n   - The EV enumerates all communication nodes visible on the physical link.  \n   - Multiple EVSEs may be detected (e.g., in scenarios with cross-talk).\n\n3. **Signal strength measurement**  \n   - The EV measures how strongly each communication node’s signal is received.\n\n4. **Signal strength analysis**  \n   - The EV compares measured signals. Three possible outcomes:  \n     a) **Low signal attenuation** → strong signal from one node.  \n     b) **Ambiguous result** → multiple nodes with uncertain or similarly strong signals.  \n     c) **High signal attenuation** → no suitable (or extremely weak) signals.\n\n5. **Branching into three results**  \n   - If **low signal attenuation** is observed:  \n     → The EV sets **Result = “EVSE_FOUND.”**  \n   - If **ambiguous** measurement is observed:  \n     → The EV sets **Result = “EVSE_POTENTIALLY_FOUND.”**  \n   - If **high signal attenuation** is observed:  \n     → The EV sets **Result = “EVSE_NOT_FOUND.”**\n\n6. **Result is “EVSE_FOUND”**  \n   - Optionally, the EV may do a sanity/validation check (depending on the scenario).  \n   - Otherwise, it can declare final result as “EVSE_FOUND” and proceed.\n\n   **Declared result is “EVSE_FOUND”**  \n   → Next step: **Setup logical network**.\n\n7. **Result is “EVSE_POTENTIALLY_FOUND”**  \n   - The EV might treat it as “EVSE_FOUND” or “EVSE_NOT_FOUND,” or it can continue with an actual **Validation of matching decision**.  \n   - If it decides not to validate further (per system rules), it may directly set “Declared result is ‘EVSE_POTENTIALLY_FOUND’” and treat it accordingly.  \n   - Otherwise, proceed to the next diamond: **Validation of matching decision**.\n\n8. **Result is “EVSE_NOT_FOUND”**  \n   - If the EV cannot identify a valid EVSE, or the signal is too weak to be recognized, the EV declares “EVSE_NOT_FOUND.”  \n   - **Declared result is “EVSE_NOT_FOUND.”**  \n   - This immediately leads to the EV calling **D-LINK_READY.IND (No link)** and exiting the process (with failure).\n\n9. **Validation of matching decision** (found on the “EVSE_POTENTIALLY_FOUND” path or optionally on the “EVSE_FOUND” path)  \n   - The EV requests (and performs) additional confirmation with the EVSE (for instance, using the control pilot “BCB-Toggle” procedure mentioned in Clause 9.4).  \n   - **Validation result?**  \n     1. **found**: The EV confirms the EVSE is correct. Proceed to “Setup logical network.”  \n     2. **not found**: The EV rejects this EVSE, checks if there is a **Remaining unvalidated EVSE?**  \n        - If **yes**, go to **next EVSE** and repeat.  \n        - If **no**, proceed to “Call D-LINK_READY.IND (No link)” (failure).\n\n10. **Setup logical network**  \n    - Once certain of the correct EVSE, the EV sets up the low-level communication (logical network).  \n    - **Data link established?**  \n      - If **yes** → **Call D-LINK_READY.IND (Link established)** → exit with success.  \n      - If **no** → **Call D-LINK_READY.IND (No link)** → exit with failure.\n\n11. **Exit matching process**  \n    - Either as a success (the EV is matched and ready for higher-layer communication) or as a failure (no valid link or incorrect EVSE discovered).\n\n12. **NOTE**  \n    - “Error handling for Matching Process is not shown in this figure. See A.9.8.” The figure omits certain fallback or error paths (e.g., hardware faults) that are described in Annex A.9.8 in the standard.\n\n---\n\n## 3. Relation and Connection Among Entities\n\n1. **EV** – The primary actor performing discovery, measurement, and analysis.  \n2. **Communication Nodes** (EVSEs) – Possible candidates that the EV might be physically attached to.  \n3. **Signal Strength Measurement** – Core step for determining whether the EV has a strong enough link to confirm “EVSE_FOUND,” or if there is ambiguity (“EVSE_POTENTIALLY_FOUND”), or if no match can be made (“EVSE_NOT_FOUND”).  \n4. **Validation Process** – A separate (optional or required) mechanism that uses control pilot line toggles to double-check the physical wiring.  \n5. **Logical Network Setup** – The bridging or data-layer step established once the EV confidently decides on an EVSE.  \n6. **D-LINK_READY.ind** – The primitive called to indicate either a successful link or a failed link to the higher layers.\n\n---\n\n## 4. Additional Notes from ISO 15118-3\n\n- **Under ambiguous conditions** (“EVSE_POTENTIALLY_FOUND”), an EV may ask the EVSE to confirm the connection via a separate pilot-line validation.  \n- **Error handling** is largely omitted in Figure 10; full details appear in Annex A.9.8.  \n- **Any transition**—whether success or failure—results in calling D-LINK_READY.IND to notify higher layers.  \n- **According to Annex 9.5**, once the logical network is successfully set up, the status changes to “Matched” and upper-layer protocols (e.g., TLS, V2G messages) can begin binding.\n\n---\n\n### Conclusion\n\nFigure 10 (EV point of view) outlines how the EV:  \n1) **Discovers** possible EVSE nodes,  \n2) **Measures** and **analyzes** each node’s signal strength,  \n3) **Determines** whether a single, multiple, or zero EVSEs are valid matches,  \n4) **Optionally validates** ambiguous results,  \n5) **Sets up** a logical network with the matched EVSE, and  \n6) **Exits** by either calling “D-LINK_READY.IND (Link established)” for success or “D-LINK_READY.IND (No link)” for failure.\n\nThis step-by-step process ensures the EV consistently identifies the correct EVSE in multi-charger environments and starts a reliable higher-level communication session for the charging process.",
    "iso3-image_19.png": "## Figure A.10 — Implementation of Parallel Injection\n\nBelow is a detailed description of each labeled element in the schematic and how they interconnect. Although this figure is presented as a circuit diagram (rather than a traditional “flowchart”), the step-by-step structure below will help you follow the signal path and understand how each component relates to the others. This diagram shows how HomePlug Green PHY signals are injected in parallel (between the Control Pilot line and ground/earth) for communication between the EVSE and EV.\n\n---\n\n### 1. Entities Overview\n\n1. **EVSE (Electric Vehicle Supply Equipment)**  \n   The left rectangular region represents the EVSE side. It provides the ±12 V, 1 kHz control pilot signal, measures voltage on the pilot line, injects and receives PLC (Power Line Communication) signals via a Green PHY modem, and references Earth (ground).\n\n2. **EV (Electric Vehicle)**  \n   The right rectangular region is the EV side. It also includes a Green PHY modem and supporting components for parallel injection and measurement of the control pilot signal (duty cycle and frequency). The EV’s contactors and internal circuitry ultimately use the pilot to detect charging states and enable communication.\n\n3. **Oscillator ±12 V, 1 kHz (Key #2)**  \n   Generates the low-frequency (1 kHz) PWM control pilot signal. This signal is crucial for basic control pilot functions prescribed by IEC 61851 (e.g., indicating EV readiness or maximum current availability).\n\n4. **Pilot Contact (Key #3)**  \n   The pilot contact is effectively the point where the EVSE’s control pilot line is physically connected to the corresponding pilot input on the EV side (through the charging cable and coupler).\n\n5. **R1 1 k (on EVSE side)**  \n   A series resistor (1 kΩ) connected to the oscillator output. It helps set the correct pilot voltage levels and limits current.\n\n6. **C_S (on EVSE side)**  \n   Often called the “control pilot capacitor” in IEC standards. It shapes the pilot signal to comply with specific requirements and influences the total capacitive behavior on the pilot line.\n\n7. **Green PHY Modems (Key #5)**  \n   Both the EVSE and EV sides include a Green PHY modem. These modems handle high-frequency HomePlug Green PHY (HPGP) communication on top of the pilot line. Each modem is shown in a dashed box on both sides (the rectangle labeled “5”).\n\n8. **R_damp (Damping Resistor) and L (Inductor)**  \n   Each side has an R_damp and L in series, forming part of the low-pass filter for the pilot signal (the LC network) and a high-pass path for the HomePlug Green PHY signals. R_damp prevents or limits resonance in the LC filter.\n\n9. **C_PLC (Coupling Capacitors to the Green PHY Modem)**  \n   These capacitors provide a high-frequency coupling path for the Green PHY signals from the pilot line into the modem, while isolating low-frequency or DC components.\n\n10. **C_v (EV side)**  \n   Defined in IEC documents, C_v is another capacitor related to the detection/measuring circuit inside the EV, usually affecting pilot line diagnostics or measurements.\n\n11. **R2, R3, and S2 (EV side)**  \n   — **R2 and R3**: Resistors on the EV side pilot circuitry, used for pilot line detection, current sensing, or dividing voltages for pilot sensing.  \n   — **S2**: A switch (or contact) that can open/close for pilot line control or internal EV states.\n\n12. **Voltage Measurement (Key #1)**  \n   Indicates that the EVSE side monitors pilot voltage levels for compliance with control pilot specifications (e.g., states A, B, C in IEC 61851).\n\n13. **Earth (ground) (Key #4)**  \n   The reference earth or protective earth (PE). The high-frequency signal is injected between the pilot line and earth/ground. This ensures the HomePlug Green PHY signals have a proper return path.\n\n14. **Duty Cycle and Frequency Measurement (Key #6)**  \n   On the EV side, the duty cycle and frequency measurement block monitors the PWM characteristics of the pilot signal (i.e., the 1 kHz, ±12 V waveform) to interpret the EVSE’s indication of available current and other pilot states.\n\n15. **Additional Components for PLC Coupling**  \n   Shown as a dashed region, these might include filters, ESD protection, or EMC compliance parts. They should not degrade the HomePlug Green PHY signals beyond stated limits.\n\n---\n\n### 2. Step-by-Step Signal Flow and Connections\n\nEven though this is a circuit schematic rather than a traditional flowchart, we can describe how signals traverse or how each function occurs in succession:\n\n1. **Pilot Signal Generation (EVSE side)**  \n   - The **oscillator (±12 V, 1 kHz)** produces the control pilot waveform.  \n   - The pilot waveform goes through **R1 (1 kΩ)** and **C_S**, shaping the signal and ensuring correct amplitude as per IEC requirements.\n\n2. **Pilot Line Connection to Green PHY Modem (EVSE side)**  \n   - The **pilot line** is also branched through the **LC filter** formed by **L** (inductor) and **R_damp** (damping resistor) to the **C_PLC** capacitor.  \n   - **C_PLC** feeds the **Green PHY modem**, allowing high-frequency components (the HPGP signal) to pass to/from the modem but blocking the lower-frequency 1 kHz pilot wave from saturating the modem.\n\n3. **Voltage Measurement (EVSE side)**  \n   - The EVSE monitors the pilot voltage (labeled Key #1) to verify pilot states, detect EV presence, and measure any duty cycle references required by the standard.\n\n4. **Pilot Contact (Connector) Between EVSE and EV (Key #3)**  \n   - The pilot line physically transitions from the EVSE circuit to the EV circuit at the **pilot contact**. This is typically inside the charging cable and coupler.\n\n5. **Green PHY Parallel Injection Path to Earth (EV Side)**  \n   - On reaching the EV side, the pilot line splits:  \n     - One path continues into the EV’s measurement and pilot control logic (through R3, R2, and possibly S2).  \n     - Another path branches through another LC filter stage (**L**, **R_damp**, **C_PLC**) to the **Green PHY modem** on the EV side. The parallel injection is again between the pilot line and **earth/ground**.  \n   - The diode shown in the pilot line (on the EV side) can be part of the standard pilot detection or protective circuitry.\n\n6. **Duty Cycle and Frequency Measurement (EV side, Key #6)**  \n   - The EV needs to interpret the EVSE’s PWM signal to understand the available current or states (A, B, C, etc.). Thus, there is a block that directly measures the pilot’s duty cycle and frequency once it has passed through the EV’s front-end components.\n\n7. **S2 (EV side switch)**  \n   - **S2** may engage or disengage certain parts of the EV’s pilot circuitry, depending on the EV’s state (e.g., if the EV is ready to charge or certain fault conditions). When closed, the pilot circuit is fully connected; when open, the pilot circuit is interrupted.\n\n8. **Additional Components for PLC Coupling**  \n   - Finally, any **additional PLC coupling** components (EMC filters, ESD protection, etc.) are placed so they do not adversely affect the high-frequency Green PHY signals or the low-frequency pilot signal. They must maintain compliance with the emission and immunity constraints (A.10 EMC requirements and others cited in ISO 15118-3).\n\n---\n\n### 3. Relationship and Purpose of Each Section\n\n- **Low-Frequency Pilot Signal Path (1 kHz)**  \n  Passes through R1, C_S, the pilot contact, R2, R3, and S2 (when closed). The EVSE and EV measure this pilot for verifying connection status, charging states, and maximum current availability.\n\n- **High-Frequency Communication Path (HomePlug Green PHY)**  \n  Injected in parallel to earth at both the EVSE and EV sides via the LC filters (L, R_damp, and C_PLC). These filters isolate the 1 kHz pilot wave from the modem but allow the higher-frequency data signals to travel between the two Green PHY modems.\n\n- **Filtering and EMC Considerations**  \n  Inductors, damping resistors, and capacitors create low-pass filtering for pilot signals and high-pass filtering for the PLC signals. This design ensures that high-frequency data does not overly distort the control pilot, while the pilot line remains within standard requirements (IEC 61851, ISO 15118-3, etc.).\n\n- **Measurement Points**  \n  Key #1 (voltage measurement) and Key #6 (duty cycle/frequency measurement) denote where the EVSE and EV measure the pilot signal. In each case, there may be a low-pass filter recommended to remove the high-frequency components from the measurement path (per the notes in ISO 15118-3).\n\n---\n\n### 4. Summary\n\nFigure A.10 demonstrates an example implementation of “parallel injection” for HomePlug Green PHY signals onto the control pilot line:\n\n- The **EVSE** supplies the main pilot signal via an oscillator and monitors pilot voltage.  \n- **Parallel injection** ensures both the EVSE and EV couple the high-frequency Green PHY signals between the pilot and ground.  \n- **Low-pass + high-pass filtering** (with L, R_damp, and capacitors) allows the 1 kHz pilot control signal to pass unimpeded while at the same time guiding the high-frequency Green PHY data to each modem.  \n- **Duty-cycle/frequency measurements** are taken by both sides (the EVSE monitors the raw pilot voltage; the EV monitors duty cycle) while the high-frequency data is superimposed.  \n\nThrough these components and connections, the system meets the dual requirements of standard pilot signaling (for charging states) and HomePlug Green PHY communication (for vehicle-to-grid data exchange) on the same control pilot conductor.",
    "iso3-image_20.png": "```markdown\n# Detailed Description of Figure 2 — [ISO-3] Relationship to the ISO/IEC OSI Reference Model\n\nThis figure shows how the Physical and Data Link layers used in ISO 15118‑3 (specifically for Power Line Communication on electric vehicles) align with the classic ISO/IEC 7498-1 (OSI) reference model. It illustrates the layered network architecture, culminating in interfaces that connect to higher-level protocols (Application, Presentation, Session, Transport, Network) and basic signaling (Control Pilot) as specified in IEC 61851‑1.\n\nBelow is a step-by-step, layer-by-layer description of each entity in the figure and how they relate to each other.\n\n---\n\n## 1. Entities Overview\n\nFrom **bottom** to **top**, the following entities appear in the diagram:\n\n1. **Communication media**  \n   The physical medium (the cable assembly) through which signals and energy are exchanged between the Electric Vehicle (EV) and the Electric Vehicle Supply Equipment (EVSE).\n\n2. **Signal coupling**  \n   This represents the method of coupling the PLC (Power Line Communication) signal onto the AC or DC charging cable. It ensures the high-frequency PLC signal is injected or extracted without interfering with the power transfer itself.\n\n3. **PLC Physical layer**  \n   The physical layer of the Power Line Communication (e.g., HomePlug GreenPHY). It defines the electrical and modulation specifications required to transmit bits over the communication media.\n\n4. **MAC/PHY SAP**  \n   The Service Access Point between the PHY (Physical) and MAC (Medium Access Control) layers. It represents the interface through which the upper layer (MAC) exchanges data and control information with the physical layer.\n\n5. **PLC MAC layer**  \n   The Medium Access Control layer that handles packet framing, addressing, and channel-access mechanisms specific to PLC (e.g., carrier-sense multiple access, collision avoidance, etc.).\n\n6. **Convergence MAC SAP**  \n   The interface between the PLC MAC layer and the convergence layer. It ensures that data from higher-layer protocols is properly formatted for MAC-layer transmission and vice versa.\n\n7. **Convergence layer**  \n   A bridging layer that adapts the classic OSI Data Link–level services (like Ethernet bridging or VLAN tagging) into the specific requirements/format of the PLC protocols. It converges or translates data to align with HomePlug GreenPHY or other PLC standards.\n\n8. **Control SAP**  \n   A specialized Service Access Point providing a control interface for the PLC or other network-management functions (e.g., encryption key management, SLAC services, link status queries). This is used by upper software modules that need direct PLC-related control/configuration.\n\n9. **Data link control SAP**  \n   An interface that provides link-status information, error management, and other data link control functionalities. This SAP ties the connection coordination module to the lower-level Data Link functionalities.\n\n10. **Connection coordination**  \n   A functional block that coordinates establishing or tearing down logical connections. It helps with matching EVs to EVSEs, exchanging handshake signals, and managing the relationship between basic IEC 61851-1 signaling and the higher, logical data connections of ISO 15118.\n\n11. **Data SAP**  \n   The interface between the Data Link layer and the Network (layer 3) or higher layers for actual V2G (vehicle-to-grid) data exchange. All high-level charging messages (e.g., those required by ISO 15118-2) flow through the Data SAP.\n\n12. **Higher layers**  \n   In OSI terms, these encapsulate the Application, Presentation, Session, Transport, and Network layers. ISO 15118-2 typically operates at these layers (exchanging XML messages, session management, security, etc.).\n\n13. **Control pilot (IEC 61851-1) Hardware I/Os**  \n   Shown to the right, this denotes the separate hardware line(s) used for “basic signaling” (PWM duty cycle, pilot states, etc.). It is not strictly part of the PLC communication stack but interplays with it (for example, telling the EV and EVSE when to begin or end coupling for high-level communication).\n\n14. **OSI reference model layers**  \n   A vertical bracket on the left reminding us that Physical and Data Link layers in the OSI model are here implemented by the PLC layers and the “convergence layer.”\n\n15. **Key**: “covered by communication technology specification”  \n   The figure highlights (in gray) the parts (Convergence layer, PLC MAC, PLC PHY, etc.) that are defined by specific communication technology standards (e.g., HomePlug GreenPHY, IEEE 1901 Profile GreenPHY).\n\n---\n\n## 2. Detailed Layer-by-Layer Explanation and “Flow”\n\nAlthough this is not a conventional “flowchart,” the diagram can be read from the **Physical** layer at the bottom to the **Application** layer at the top to understand how data flows and which components interact:\n\n1. **Communication Media (Bottom Layer)**  \n   • Power cabling used for vehicle charging is also used to carry data signals.  \n   • Power is transferred from the EVSE to the EV; meanwhile, high-frequency signals are superimposed for data exchange.\n\n2. **Signal Coupling Layer**  \n   • Couples the PLC signal on top of the AC or DC power line.  \n   • Ensures minimal interference and correct impedance matching to pass data effectively between EV and EVSE.\n\n3. **PLC Physical Layer**  \n   • Responsible for modulating and demodulating waveforms on the power line.  \n   • Follows standards such as HomePlug GreenPHY for robust physical signaling (e.g., OFDM, error correction).\n\n4. **MAC/PHY SAP**  \n   • Logical interface that the MAC layer uses to send and receive frames (bits, symbols) via the Physical layer.  \n   • Transmits or receives packets after being encoded/decoded at the PHY.\n\n5. **PLC MAC Layer**  \n   • Implements media access rules (channel sensing, collision avoidance, etc.).  \n   • Adds header/trailer fields managing addressing and error detection.  \n   • Manages bridging to upper or lower layers via convergence sub-layers.\n\n6. **Convergence MAC SAP**  \n   • Provides a standardized interface for the next layer (Convergence layer) to get data from MAC frames.  \n   • Ensures correct framing and token passing between the Convergence and MAC layers.\n\n7. **Convergence Layer**  \n   • Adapts the PLC MAC frames into a more generic data link structure or vice versa.  \n   • Potentially includes bridging or VLAN tagging for IP-based or ISO 15118-2 application data.  \n   • At this layer, the system transitions from technology-specific data link frames to a more general data link service usable by higher protocols.\n\n8. **Control SAP**  \n   • A specialized side-interface that configuration/control processes (like encryption-key management or the SLAC process used for EV–EVSE association) can call.  \n   • Enables reading/writing certain parameters in the PLC MAC or PHY, including link status, encryption keys, and networking specifics.\n\n9. **Data Link Control SAP**  \n   • Presents data link status (connected, disconnected, error) and handles command signals for enabling or disabling link functionalities.  \n   • Ties in to the Connection Coordination function, letting higher-layer logic know about link conditions.\n\n10. **Connection Coordination**  \n    • Supervises or orchestrates which link or channel is used, how the handshake or matching occurs, and whether the EV and EVSE are “paired.”  \n    • Tightly integrated with basic signaling from IEC 61851-1 (Control Pilot) and high-level communication from ISO 15118-2.\n\n11. **Data SAP**  \n    • The normal “data” interface for exchanging V2G protocol payloads (e.g., charging session requests, contract identification) between the Data Link layer and the higher OSI layers (Network and above).  \n    • Actual ISO 15118-2 messages pass through this Data SAP after being encapsulated into MAC frames.\n\n12. **Higher Layers**  \n    • Spanning OSI Layers 3 to 7 (Network, Transport, Session, Presentation, Application).  \n    • In the context of ISO 15118, these higher layers format, encrypt, and interpret the actual “plug-and-charge” or “vehicle-to-grid” messages.\n\n13. **Control Pilot (IEC 61851-1) Hardware I/Os**  \n    • Shown on the right side as a separate domain.  \n    • Provides basic PWM signaling to indicate EV states, EVSE states, maximum current capability, presence of the EV, or charging fault conditions.  \n    • Ties into overall Connection Coordination to start or stop the PLC communication as required by the standard.\n\n---\n\n## 3. Relationship and Connection of Entities\n\n- **Physical to MAC**  \n  Data moves from the **Communication media** (power lines) through **Signal coupling** into the **PLC Physical layer**, which transmits/receives bits. The **MAC/PHY SAP** is then used to pass frames to/from the **PLC MAC layer**.\n\n- **MAC to Convergence**  \n  The **PLC MAC layer** sends or receives data frames to the **Convergence layer** through the **Convergence MAC SAP**. At this stage, commands and bridging logic are aligned with the needs of higher-level protocols.\n\n- **Convergence to Higher Protocols**  \n  After the Convergence layer, there are multiple SAPs:\n  1. **Control SAP** for direct PLC control and configuration queries (e.g., security keys, link info).  \n  2. **Data Link Control SAP** for controlling the link status, error notifications, and link enable/disable.  \n  3. **Data SAP** for normal data traffic that flows up to the OSI Network or Transport layers.\n\n- **Coordination with Basic Signaling**  \n  The **Connection coordination** block leverages the **Control SAP** and **Data link control SAP** to manage the handshake between the EV and EVSE at both the PLC level and the basic PWM signaling level. Meanwhile, the **Control pilot** line (IEC 61851-1) physically coordinates the presence detection and permissible current via the duty cycle.\n\n- **Higher Layers**  \n  Above the **Data SAP**, normal IP networking (or the ISO 15118-2 application messages) can proceed. These higher-layer protocols rely on the data path established at lower layers by the PLC system and are orchestrated by the **Connection coordination** function.\n\n---\n\n## 4. Key Takeaways\n\n1. **Layered Architecture**  \n   The figure highlights how the Physical and Data Link layers of ISO 15118‑3 map directly onto the OSI reference model. The “convergence layer” ensures that higher layers can remain mostly independent of the underlying PLC technology.\n\n2. **Control vs. Data**  \n   Two main SAP families exist:  \n   - **Control SAP / Data Link Control SAP**: For link management, error reporting, and secure network configuration.  \n   - **Data SAP**: For passing normal application data (ISO 15118-2 messages) to the upper layers.\n\n3. **Basic Signaling Integration**  \n   IEC 61851-1’s control pilot is shown outside the PLC stack, yet it is integral to “Connection coordination,” ensuring correct startup, safety interlocks, and fallback charging states.\n\n4. **Covered by Communication Technology Specification**  \n   The gray regions (Convergence layer, MAC, PHY) are implementations guided by specific PLC standards (e.g., HomePlug GreenPHY). They are thus “covered by communication technology specification.”\n\nBy understanding each block and interface, engineers can quickly trace how signals and data flow from the power line (physical) up to the ISO 15118 application protocol, and how the system coordinates the link state with basic pilot signaling.\n```",
    "iso3-image_21.png": "# Detailed Description of Figure A.11 — HomePlug Green PHY-Transmission Path Example\n\nBelow is a comprehensive description of the flow chart shown in “Figure A.11 — HomePlug Green PHY-Transmission path example with SLAC relevant attenuations and calculations.” The diagram illustrates how the Power Line Communication (PLC) signal (M-Sound, in this context) travels from the Electric Vehicle (EV) side to the Electric Vehicle Supply Equipment (EVSE) side, with all the associated insertion losses, power spectral densities (PSDs), and measurement steps.\n\n---\n\n## 1. Entities Overview\n\n1. **PLC node EV**  \n   - Houses a Green PHY modem.  \n   - Has two paths connected to the modem:  \n     - Rx-Path AttnRxEV (receiving path insertion loss).  \n     - Tx-Path AttnTxEV (transmitting path insertion loss).\n\n2. **Charge cord (AttnCord)**  \n   - The physical charging cable between the EV and the EVSE.  \n   - It introduces its own insertion loss to the signal.\n\n3. **PLC node EVSE**  \n   - Also houses a Green PHY modem on the EVSE side.  \n   - Has two paths connected to the modem:  \n     - Rx-Path AttnRxEVSE (receiving path insertion loss).  \n     - Tx-Path AttnTxEVSE (transmitting path insertion loss).\n\n4. **PSD of M-Sound along the transmission path**  \n   - Shows the power spectral density at various points from EV to EVSE:  \n     - PSD at the EV modem transmitter output.  \n     - PSD at the EV socket.  \n     - PSD at the EVSE socket.  \n     - PSD at the EVSE modem input.\n\n5. **SLAC Measurement**  \n   - Refers to the Signal Level Attenuation Characterization measurement.  \n   - Uses a reference PSD of −50 dBm/Hz.  \n   - The EVSE corrects the measured values by adding back AttnRxEVSE (its insertion loss) before reporting to the EV.\n\n6. **Attenuation for Matching Decision**  \n   - A procedure to determine the final attenuation value by comparing reported attenuation values against a reference PSD (−26 dB in the example).  \n   - Averaged over all relevant carrier groups.\n\n7. **Reported Attenuation**  \n   - The final attenuation reported (e.g., “−28 dB”) is the per-carrier-group attenuation, factoring in EVSE’s internal correction.\n\n---\n\n## 2. Flow of the Diagram (Step by Step)\n\nThe flow chart is read primarily from left to right (EV side to EVSE side), with a bottom branch showing how the SLAC measurement and final attenuation decisions are derived.\n\n1. **PSD at Trncv Output (EV side)**  \n   - The Green PHY modem inside the EV transmits the signal at a power spectral density of **−72 dBm/Hz**.  \n   - This output is labeled “PSD of M-Sound along the transmission path from EV to EVSE.”\n\n2. **−AttnTxEV**  \n   - The transmitting path on the EV side (Tx-Path AttnTxEV) incurs an insertion loss (example: ~4 dB).  \n   - After subtracting this loss, the resulting PSD at the EV socket is **−76 dBm/Hz** (the “design target”).\n\n3. **Passing Through Charge Cord (−AttnCord)**  \n   - The charge cord itself (AttnCord) further attenuates the signal.  \n   - The PSD at the EVSE socket becomes **−78 dBm/Hz**.\n\n4. **−AttnRxEVSE**  \n   - On the EVSE side, the receiving path (Rx-Path AttnRxEVSE) imposes an additional insertion loss (example: ~3 dB).  \n   - The PSD finally arrives at the EVSE modem input at **−81 dBm/Hz**.\n\n5. **SLAC Measurement**  \n   - The EVSE performs a SLAC measurement referencing **−50 dBm/Hz** as a baseline.  \n   - The raw measurement (labeled “−31 dB”) represents how much the EVSE side sees relative to −50 dBm/Hz.\n\n6. **Correction of Insertion Loss (AttnRxEVSE)**  \n   - Since the EVSE must correct for its own internal Rx-Path loss (AttnRxEVSE), it adds back this loss value.  \n   - This results in a final reported measured attenuation of **−28 dB** per carrier group.\n\n7. **Calculations for Attenuation Measurement for Matching Decision**  \n   - In parallel (shown at the bottom branch of the figure), the PSD at the EV socket (−76 dBm/Hz) is compared against a reference PSD mention (−50 dBm/Hz) with a reference offset (−26 dB).  \n   - The difference is averaged over all carrier groups to get a scalar attenuation value. An example final result shown is **2 dB**.\n\n8. **Report of Measured Attenuation**  \n   - The EVSE finally reports “−28 dB” as the measured attenuation per carrier group (after the insertion-loss correction).  \n   - The bottom label notes that the “Attenuation for matching decision is determined by averaging the difference between the reported attenuation values and the reference PSD over all carrier groups.”\n\n---\n\n## 3. Relation and Connection of Entities\n\n- **EV (PLC node EV) → EV Socket**:  \n  Signal originates from the EV’s Green PHY modem at −72 dBm/Hz. The “Tx-Path AttnTxEV” reduces it by a few dB (e.g., 4 dB).\n\n- **EV Socket → Charge Cord**:  \n  The EV socket outputs ~−76 dBm/Hz. The cord (AttnCord) introduces further loss, giving ~−78 dBm/Hz at the EVSE socket.\n\n- **EVSE Socket → EVSE Modem**:  \n  The signal then passes through the “Rx-Path AttnRxEVSE.” By the time it reaches the EVSE modem input, it is at ~−81 dBm/Hz.\n\n- **SLAC Measurement Reference**:  \n  The EVSE measures the signal level relative to −50 dBm/Hz. The measured result (−31 dB) is adjusted upward by the known AttnRxEVSE (3 dB in the example) to give a final reported attenuation of −28 dB.\n\n- **Attenuation for Matching Decision**:  \n  A reference of −26 dB is used to gauge how much attenuation is really observed relative to the design PSD target. An example final scalar value of 2 dB is shown, though in practice it is averaged over multiple carrier groups.\n\n---\n\n## Notes and Key Takeaways\n\n- All PSD and attenuation values in the diagram (−72 dBm/Hz, −76 dBm/Hz, −78 dBm/Hz, −81 dBm/Hz, etc.) are examples for illustration. Real values depend on design, cables, coupling components, and actual measurement setups.  \n- AttnRxEV, AttnTxEV, AttnRxEVSE, AttnTxEVSE, and AttnCord are all insertion-loss factors contributing to the overall reduction of the PLC signal from the EV modem transmitter to the EVSE modem receiver (and vice versa).  \n- The SLAC procedure relies on having a known reference PSD of −50 dBm/Hz and requires the EVSE to correct for its own internal losses before reporting attenuation data back to the EV.\n\nThis completes the detailed breakdown of the figure, step-by-step, helping engineers understand precisely how the HomePlug Green PHY communication path is measured and how attenuation values are derived.",
    "iso3-image_22.png": "## 1. Introduction\n\nFigure A.12 in ISO 15118‑3 Annex A (shown above) illustrates a measurement setup used to determine the electrical characteristics (in particular, the power spectral density or PSD) of a vehicle-to-grid (V2G) device’s transmitted signal. This setup allows engineers to measure how well a device under test (DUT)—an electric vehicle (EV) or electric vehicle supply equipment (EVSE)—complies with HomePlug Green PHY communication requirements when the communication signal is superimposed on the control pilot line.\n\nThe figure contains several labeled entities. Below is a detailed description of each entity, followed by how they connect and function within the measurement procedure.\n\n---\n\n## 2. Entities in the Measurement Setup\n\n1. **PLC node**  \n   • Symbol in Figure: (1)  \n   • Role: A “Power Line Communication” node within the DUT. It generates or processes the HomePlug Green PHY signals that travel over the control pilot line.  \n   • Example Function: This node can be integrated into the EV’s onboard charger or the EVSE’s internal controller to handle G3-PLC signals for vehicle-to-grid communication.\n\n2. **EV or EVSE control pilot circuit according to IEC 61851‑1:2010, Annex A**  \n   • Symbol in Figure: (2)  \n   • Role: This standard “control pilot” circuit is part of the electrical interface responsible for signaling between the vehicle and the charging station.  \n   • Example Function: Governs charging states, safety checks, and indicates whether the vehicle is connected or requesting charge.\n\n3. **Data modem**  \n   • Symbol in Figure: (3)  \n   • Role: A modem that processes data from the PLC node to be transmitted along the pilot line.  \n   • Example Function: Converts digital data into a form suitable for power line communication (and vice versa).\n\n4. **Control pilot**  \n   • Symbol in Figure: (4)  \n   • Role: The physical line itself along which both the standard IEC 61851 pilot signaling and the HomePlug Green PHY signals are carried.  \n   • Example Function: Provides PWM charging signals for the EV (per IEC 61851) and simultaneously carries broadband PLC data for vehicle-network communications.\n\n5. **Splitter**  \n   • Symbol in Figure: (5)  \n   • Role: A device used to separate or combine signals on the control pilot line. It routes signals to the measurement paths and to the PLC counterpart station.  \n   • Example Function: Ensures the measurement instrument (spectrum analyzer) can “see” the signal while still allowing normal PLC data exchange with the counterpart station.\n\n6. **PLC counterpart station**  \n   • Symbol in Figure: (6)  \n   • Role: A station that communicates with the DUT in order to maintain active data exchange on the control pilot line.  \n   • Example Function: Emulates or acts as the remote end of the PLC link so that the DUT can transmit and receive data during testing (at least 20 % of max data rate).\n\n7. **Spectrum analyser**  \n   • Symbol in Figure: (7)  \n   • Role: The measurement instrument used to visualize and quantify the power spectral density of the signal.  \n   • Example Function: Receives the high-frequency components of the PLC signal through the coaxial connection and measures them over the 1.8–30 MHz band with a 50 Ω input.\n\n8. **Z = 50 Ω**  \n   • Description: Denotes the 50 Ω system impedance, essential for calibration and for ensuring consistent PSD measurement conditions.  \n   • Example Function: Matching the required input impedance for standardized measurement (common in high-frequency test setups).\n\n9. **5 kΩ**  \n   • Description: A 5 kΩ resistor which isolates the PLC counterpart station from directly influencing the DUT’s measured output impedance.  \n   • Example Function: Prevents undesired loading effects from the counterpart station on the pilot line during the PSD measurement.\n\n10. **Additional components for PLC coupling**  \n   • Description: Internal parts (e.g., coupling capacitors, filters, baluns) ensuring that the PLC signals are coupled onto the control pilot line while power/control signals pass properly.  \n   • Example Function: Manage EMI requirements, help shape the signal band, and ensure compliance with standards.\n\n11. **50 Ohm coax cable**  \n   • Description: Transmission line connecting the splitter to the spectrum analyzer.  \n   • Example Function: Preserves signal integrity with a 50 Ω characteristic impedance for accurate frequency-domain measurements.\n\n12. **R_Damp**  \n   • Description: A damping resistor used internally in the DUT’s coupling network to tune or stabilize the PLC signal amplitude and reduce reflections.  \n   • Example Function: Helps maintain consistent power levels on the pilot line.\n\n13. **L**  \n   • Description: An inductance placed in series, part of the coupling or filtering network.  \n   • Example Function: Blocks or shapes certain frequencies so that the pilot’s standard signaling and PLC signals do not interfere undesirably.\n\n14. **C_PLC**  \n   • Description: A coupling or filter capacitor for the PLC path.  \n   • Example Function: Provides the high-frequency path for data communication while blocking low-frequency/control signals and DC components.\n\n15. **DUT**  \n   • Description: “Device Under Test.” This entire system in the dashed box includes the PLC node, modem, pilot circuit, and coupling components.  \n   • Example Function: Could be an EV or an EVSE with integrated PLC functionality being tested per ISO 15118‑3 guidelines.\n\n---\n\n## 3. Detailed Connection and Signal Flow\n\nBelow is a step-by-step description of how signals and measurement paths flow through Figure A.12. Even though it is not a “flowchart” of processes, each connection is crucial for understanding the measurement setup:\n\n1. **DUT (Device Under Test)**  \n   • The DUT is shown as a dashed boundary in the illustration. Inside it are:  \n     – The **PLC node (1)**, tasked with generating or receiving PLC signals.  \n     – The **EV/EVSE control pilot circuit (2)**, managing standard IEC 61851 pilot functionality.  \n     – The **data modem (3)**, which converts digital data for PLC.  \n     – Internal coupling elements: **R_Damp**, **L**, and **C_PLC**, ensuring the signal is properly shaped for pilot-line communication.\n\n2. **Control Pilot Line Out of the DUT (4)**  \n   • The control pilot line (4) emerges from the DUT. This single conductor carries both the control pilot (low-frequency) signals and the power-line communication (high-frequency) signals.\n\n3. **Entering the Splitter (5)**  \n   • Immediately after exiting the DUT, the pilot line is attached to a **splitter (5)**.  \n   • The splitter has two primary outputs:  \n     1. One path continues to the **PLC counterpart station (6)**. This path includes a **5 kΩ resistor** in series, ensuring that the station’s impedance does not unduly affect the PSD measurement.  \n     2. The other path leads to the **50 Ohm coax cable**, which feeds into the **spectrum analyser (7)**.\n\n4. **Connection to the PLC Counterpart Station (6)**  \n   • The **PLC counterpart station (6)** ensures that the DUT remains in active communication mode (at least 20 % of the maximum data rate), as required by the measurement procedure.  \n   • This communication link is vital; it ensures realistic signal generation from the DUT while measuring.\n\n5. **Measurement Path to the Spectrum Analyser (7)**  \n   • From the splitter’s second output, a **50 Ω coax cable** carries the high-frequency PLC signal to the **spectrum analyser (7)**.  \n   • The spectrum analyser’s input impedance is 50 Ω, matching the coax cable and system design. This allows direct measurement of the signal’s power over frequencies ranging roughly 1.8–30 MHz.\n\n6. **50 Ω System and Additional Coupling Components**  \n   • Within the measurement path, **Z = 50 Ω** is consistently presented to ensure standard reference conditions.  \n   • Any **additional components for PLC coupling** (not explicitly shown inside the dashed boundary) are assumed to be 50 Ω compliant, with the system’s overall insertion losses accounted for in measurement calibration.\n\n---\n\n## 4. Purpose and Notes on the Measurement Setup\n\n- **Power Spectral Density (PSD) Measurement:**  \n  The main objective is to measure the PSD of the DUT’s transmitted PLC signal on the pilot line. Engineers collect data via the spectrum analyzer (7) in the 1.8–30 MHz band with a 9 kHz resolution bandwidth (per CISPR 16).\n\n- **Isolation and Impedance Control:**  \n  A **5 kΩ resistor** between the PLC counterpart station and the pilot line prevents the station’s input impedance from skewing measurement results. Meanwhile, the system is designed to maintain a **50 Ω** environment from the DUT’s pilot line to the spectrum analyzer.\n\n- **Ensuring Active Communication:**  \n  The DUT must actively transmit data (≥ 20 % of max data rate) to create realistic PLC signals. The **PLC counterpart station (6)** assists by maintaining a “live” communication link.\n\n- **Damping and Filtering Components:**  \n  **R_Damp**, **L**, and **C_PLC** regulate and shape the PLC waveform, ensuring compliance with relevant noise and crossover requirements.\n\n- **Calibration Procedure:**  \n  When conducting the measurement:  \n  1. The spectrum analyzer is set up with proper attenuation to avoid overload.  \n  2. The measurement is recorded across 1.8–30 MHz with a 9 kHz RBW (resolution bandwidth).  \n  3. The analyzer’s equivalent noise power bandwidth is factored out to compute the true PSD.\n\n---\n\n## 5. Summary of Key Steps\n\n1. The DUT (including the embedded PLC node and control pilot circuitry) generates the communication signal.  \n2. The control pilot line (4) exits the DUT and enters a splitter (5).  \n3. One output of the splitter connects through a 5 kΩ resistor to the PLC counterpart station (6), keeping the communication session active.  \n4. The other splitter output feeds a 50 Ω coax cable, connecting to a spectrum analyzer (7).  \n5. Engineers measure the signal’s PSD and compare it to standard thresholds defined for V2G communications.\n\nThis setup meets ISO 15118‑3, Clause A.11 requirements by ensuring:  \n• A 50 Ω measurement environment,  \n• Isolation from the counterpart station,  \n• Real-time data flow,  \n• Proper instrumentation bandwidth and calibration.\n\n---\n\n## 6. Conclusion\n\nFigure A.12 offers a comprehensive test layout, ensuring consistent and reproducible measurement of PLC signals on the control pilot line for V2G applications. Each component—from the DUT’s internal coupling network down to the spectrum analyzer—contributes to an accurate PSD measurement. By following this schematic, engineers can evaluate whether an EV or EVSE meets the HomePlug Green PHY requirements specified in ISO 15118‑3, providing reliable and standardized communication performance over the control pilot line.",
    "iso3-image_23.png": "# Detailed Description of Figure A.13 – Implementation Example with a HomePlug Green PHY Coupling Transformer\n\nBelow is a detailed, step-by-step description of the schematic labeled “Figure A.13 — Implementation example with a HomePlug Green PHY coupling transformer.” Although the figure is presented more like a circuit schematic than a traditional flowchart, this explanation follows each “path” and notes all components to help engineers quickly understand how signals and connections are arranged.  \n\n---\n\n## 1. Overall Schematic Overview\n\nThe diagram shows two main sections:\n\n1. **EVSE (Electric Vehicle Supply Equipment) side** (left block)  \n2. **EV (Electric Vehicle) side** (right block)  \n\nThese two blocks are connected via the **control pilot line** and share the same protective earth/ground reference. Within each block, various components provide:\n\n- The generation and measurement of the PWM “control pilot” signal (nominal ±12 V at 1 kHz).  \n- The coupling of high-frequency HomePlug Green PHY signals through a dedicated transformer and capacitors.  \n- Protective and filtering elements (resistors, inductors, damping networks, diodes).  \n\nThe high-level purpose is to **inject** and **receive** HomePlug Green PHY communication signals over the control pilot while simultaneously maintaining the standard EVSE–EV PWM control signal (1 kHz) and capturing duty-cycle and amplitude measurements.\n\n---\n\n## 2. Entities (Components) and Their Roles\n\nBelow is a list of the labeled entities from the figure and a short description of each:\n\n1. **Amplitude/state measurement** (labeled “1”)  \n   - Measures the voltage amplitude of the pilot signal, helping determine EV connection state and diagnostic information.\n\n2. **Oscillator ±12 V 1 kHz** (labeled “2”)  \n   - The fundamental PWM generator that provides the control pilot signal (±12 V) at 1 kHz on the EVSE side.\n\n3. **PLC chipset** (labeled “3”)  \n   - The HomePlug Green PHY powerline communication module. It couples the data signal onto the control pilot line through a transformer and filter network.\n\n4. **Charge cord Cc < 1 500 pF** (labeled “4”)  \n   - Indicates the total parasitic capacitance of the charging cord connecting the EVSE pilot line to the EV’s inlet. It must be below 1,500 pF.\n\n5. **Dutycycle measurement** (labeled “5”)  \n   - A measurement block that evaluates the PWM duty cycle on the EV side. The EV uses this for determining the available current and state of charge control.\n\n6. **Implementation example with a HomePlug Green PHY coupling transformer** (text at the bottom of the diagram) and **Figure A.13**  \n   - Indicates that this schematic is the official example of how to implement a HomePlug Green PHY coupling onto the control pilot line.\n\n7. **R1, R2, R3**  \n   - Resistors necessary to meet IEC 61851 or ISO 15118 pilot wiring guidelines (e.g., R1 on the EVSE side, R2 & R3 inside the EV circuit). They help set pilot voltages and sense states.\n\n8. **L** (shown on both EVSE and EV as part of an LC filter with “RDamp”)  \n   - An inductor for filtering and shaping the communication and pilot signals. Often used to suppress high-frequency noise.\n\n9. **S2**  \n   - A switching element on the EV side. It may represent enable/disable or grounding states as required by the control pilot standard (IEC 61851).\n\n10. **RDamp**  \n    - A damping resistor (220 Ω in the example) placed in series with the inductor L. It helps control or damp resonances in the pilot line.\n\n11. **Cs**  \n    - A capacitor on the EVSE side that, together with R1 and other passive components, forms part of the pilot shaping and filtering network.\n\n12. **CM**  \n    - A small coupling capacitor (100 pF in the example) used for noise filtering or common-mode coupling.\n\n13. **RM**  \n    - A resistor in the megaohm-to-kilohm range (shown as 10 kΩ in the example). Often used to form a referencing path for measuring pilot or for protection.\n\n14. **2× CPLC**  \n    - Two coupling capacitors (each about 1.35 nF in the example) that convey the high-frequency communication signals from the PLC chipset transformer out to, or in from, the pilot line—while blocking the low-frequency (1 kHz) PWM from interfering directly with the PLC chipset.\n\n15. **CV**  \n    - Another capacitor (labeled “[IEC-1]” in the example table) on the EV side for pilot signal conditioning or filtering.\n\n16. **D**  \n    - A diode in the EV circuit. It can be for polarity protection or controlling certain pilot states (e.g., releasing pilot line if there is an error).\n\n17. **EVSE**  \n    - The electric vehicle supply equipment block containing the control pilot generation, measurement, and the PLC modem coupling network (left-hand block).\n\n18. **EV**  \n    - The electric vehicle block containing the pilot detection circuit, duty cycle measurement, and the complementary PLC modem coupling (right-hand block).\n\n---\n\n## 3. Signal Paths and Connections\n\nAlthough not a classic “flowchart,” the diagram displays how signals flow between the EVSE and EV via the pilot line. The main paths are:\n\n1. **Pilot PWM Path (Low-Frequency: 1 kHz)**  \n   - On the **EVSE side**, the ±12 V, 1 kHz oscillator (2) injects the control pilot signal.  \n   - The pilot amplitude is monitored by the **amplitude/state measurement** (1) in the EVSE to detect EV presence and state transitions.  \n   - On the **EV side**, the duty-cycle measurement (5) monitors the arriving PWM for the pilot signal’s high/low levels. The EV can switch S2 or adjust internal connections to signal different EV states (e.g., charging, ventilation required, etc.).  \n   - **R1, R2, R3, Cs, CV, CM, and RM** adjust or sense the pilot line level and ensure pilot compliance to IEC 61851-1.\n\n2. **HomePlug Green PHY Data Path (High-Frequency: ~1.8 MHz–30 MHz)**  \n   - **PLC chipset (3)** on the EVSE side drives/receives high-frequency signals through a **coupling transformer** and the pair of capacitors **(2× CPLC)**.  \n   - The communication signals combine with the pilot line through these coupling capacitors but do not substantially affect the 1 kHz pilot thanks to filtering by the inductor **L**, resistors **RDamp**, and other high-frequency–blocking elements.  \n   - At the **EV side**, the high-frequency PLC signal also couples via **2× CPLC** and a similar **transformer** arrangement.  \n   - **L** (the inductor) and **RDamp** components on both sides help prevent large resonance or undesired signal reflection.  \n   - The diode **D** can protect the EV from any reversed or high-voltage events.  \n\n3. **Charge Cord Consideration**  \n   - The **charge cord Cc < 1 500 pF** (4) is shown as the cable parasitic capacitance. Keeping this capacitance low is necessary to preserve signal integrity for both the pilot PWM and high-frequency PLC communication.\n\n4. **Ground/Earth Reference**  \n   - Both EVSE and EV are referenced to a common ground for safety and measurement consistency.  \n   - The standard requires that the pilot line operate with known references for amplitude measurement and duty cycle detection.\n\n---\n\n## 4. Step-by-Step Function (Interpretation)\n\nTo interpret this schematic in a stepwise “flow,” consider the main functionality:\n\n1. **Pilot Signal Generation (EVSE side)**  \n   a. The oscillator (2) outputs a ±12 V, 1 kHz PWM.  \n   b. This signal passes through R1, Cs, and other pilot-conditioning components.  \n   c. The **amplitude/state measurement** (1) on the EVSE side observes the pilot voltage amplitude to detect EV presence.  \n\n2. **Pilot Signal Transmission via Control Pilot**  \n   a. The pilot line travels through the charge cord.  \n   b. **2× CPLC** capacitors on each side couple the broadband PLC signals but appear high-impedance at low frequency (1 kHz), so the pilot is only mildly affected.  \n   c. The pilot line arrives at the EV’s circuit with R2, R3, etc., that set or detect the pilot level.  \n\n3. **Pilot Signal Detection (EV side)**  \n   a. The duty cycle measurement (5) block measures the incoming PWM signal.  \n   b. S2 and the diode (D) can switch states according to standard charging protocols (e.g., controlling whether the EV is ready for charging, demands ventilation, etc.).  \n\n4. **HomePlug Green PHY Communication**  \n   a. The EVSE’s PLC chipset (3) injects high-frequency signals through a coupling transformer and **2× CPLC**.  \n   b. The EV’s PLC circuitry also couples through an identical transformer and capacitor arrangement.  \n   c. Inductor (L) and RDamp on both sides help shape or attenuate high-frequency noise.  \n   d. This ensures data can flow between EVSE and EV over the same pilot line used for PWM.  \n\nBy combining these steps, the system achieves **both** standard pilot control (per IEC 61851-1) **and** high-frequency data communication (per ISO 15118 / HomePlug Green PHY).\n\n---\n\n## 5. Additional Notes for Engineers\n\n- **Component Values**:  \n  Table A.12 of the standard gives typical component values (e.g., L = 220 µH, RDamp = 220 Ω, CPLC = 1.35 nF, etc.). Actual values depend on the specific PLC chipset design and compliance with ISO 15118-3 and IEC 61851.  \n\n- **50 Ω Considerations**:  \n  Many measurement recommendations in ISO 15118-3 specify a 50 Ω environment (e.g., for spectrum analyzers, for measuring PSD). The design must ensure consistent 50 Ω terminations and minimal insertion loss in the PLC frequency range.\n\n- **PWM Integrity**:  \n  The pilot’s ±12 V amplitude and shape must not be distorted beyond specification. This includes ensuring the high-frequency coupling doesn’t degrade the 1 kHz pilot signal or the EV’s ability to measure duty cycle accurately.\n\n- **Safety**:  \n  Elements like the diode (D) and the resistor networks protect against transient conditions and ensure no unsafe voltages appear on the pilot line.\n\n---\n\n## 6. Summary\n\nFigure A.13 illustrates a complete example of how to **inject HomePlug Green PHY signals** onto the **control pilot** between EVSE and EV, while still respecting the **IEC 61851** pilot requirements (±12 V at 1 kHz) and enabling **iso15118** high-level communication. Each component shown is carefully chosen to filter, protect, or measure signals at both low (1 kHz pilot) and high (1.8–30 MHz) frequencies, ensuring proper broadband communication and standard-compliant PWM pilot functionality.",
    "iso3-image_24.png": "# Detailed Description of Figure B.1 (ISO 15118 Physical and Data Link Layer Relationship)\n\nBelow is a comprehensive, step-by-step breakdown of the diagram titled  \n**Figure B.1 — ISO 15118 physical and data link layer relationship to the ISO/IEC OSI reference model**.  \nThe figure depicts the mapping of G3-PLC (IEEE 1901.2) layers onto the standard OSI Reference Model, highlighting the physical and data link layers and how they interface with the higher OSI layers.\n\n---\n\n## 1. Entities Overview\n\nThis figure aligns the lower layers (Physical and Data Link) from ISO 15118-3 with the classic seven-layer **OSI reference model**. The main entities (or “blocks”) and interfaces are:\n\n1. **OSI Reference Model Layers**  \n   - Application  \n   - Presentation  \n   - Session  \n   - Transport  \n   - Network  \n   - Data Link  \n   - Physical  \n\n2. **Higher Layers**  \n   - These represent the OSI layers above the Data Link layer (i.e., Network, Transport, Session, Presentation, Application). In the figure, these are shown merged into a single box labeled “Higher layers.”\n\n3. **6LoWPAN Adaption Sublayer**  \n   - A sublayer that adapts IPv6-based networking (especially in low-power wireless scenarios) to the underlying MAC/PHY used here (G3-PLC). It typically sits between the Network layer and MAC layer in the layered architecture.\n\n4. **MAC Layer**  \n   - Stands for **Media Access Control**. It is responsible for controlling how data is placed onto and accessed from the communication media.  \n   - In the figure, the MAC layer has two associated interfaces:\n     - **MCPS-SAP** (MAC Common Part Sublayer Service Access Point)  \n     - **MLME-SAP** (MAC Layer Management Entity Service Access Point)  \n\n5. **Physical Layer**  \n   - The lowest layer in the OSI model, responsible for the electrical signals and raw bit transmission through the medium.  \n   - In the figure, the Physical layer has two associated interfaces:\n     - **PD-SAP** (Physical Data Service Access Point)  \n     - **PLME-SAP** (Physical Layer Management Entity Service Access Point)  \n\n6. **SAP Interfaces**  \n   - **Data link Data SAP**: An interface that provides data services for higher layers (e.g., passing data packets from the upper sublayer to the MAC).  \n   - **Data link Control SAP**: An interface providing control functionality (e.g., link status, error reporting) for managing the lower-level link behavior.\n\n7. **Signal Coupling**  \n   - The method by which the PLC (Power Line Communication) signal is coupled or injected onto the **communication media**.  \n   - In the figure, it is shown as an oval connecting the Physical layer to the communication media.\n\n8. **Communication Media**  \n   - The actual physical cable or medium (control pilot line in the charging cable assembly).  \n   - Responsible for carrying the PLC signal between EV and charging station.\n\n9. **Pilot Line**  \n   - The specific line or conductor used to carry not only the pilot signal for charging control but also the PLC signal in G3-PLC communication.\n\n10. **Covered by G3 Specification** (Key)  \n   - A legend (“covered by G3 specification”) is shown in a gray box to indicate which layers and interfaces fall under the scope of G3-PLC.\n\n11. **Key**  \n   - Indicates how the elements in gray shading (“covered by G3 specification”) relate to the OSI model.\n\n---\n\n## 2. Hierarchical Layout and Relationships\n\nAlthough the figure does not represent a **sequential** flow like a typical flowchart, it shows *which OSI layers correspond to which G3-PLC sublayers and interfaces*. Below is a top-to-bottom description:\n\n1. **Higher Layers (Application, Presentation, Session, Transport, Network)**  \n   - These top layers of the OSI stack are collectively shown as “Higher layers” in the G3-PLC architecture diagram. They rely on the data link and physical layers for actual data transmission over the pilot line.\n\n2. **Data Link Layer**  \n   - In the classic OSI model, the Data Link layer is a single block. In the G3-PLC context, it is subdivided further into:  \n     - **6LoWPAN Adaptation Sublayer**  \n       - Bridges IPv6 (network layer) and the underlying MAC.  \n       - Provides fragmentation, compression, and adaptation for low-bandwidth links.  \n     - **MAC Layer**  \n       - Implements media access control (channel access methods, scheduling, addressing).  \n       - Provides data service (MCPS-SAP) and management service (MLME-SAP).\n\n3. **Service Access Points (SAPs) at the Data Link Layer**  \n   - **Data link Data SAP**  \n     - Provides a data interface for higher layers to send and receive frames.  \n   - **Data link Control SAP**  \n     - Offers link status and control information (e.g., error conditions, link up/down events).\n   - **MCPS-SAP** (MAC Common Part)  \n     - The SAP for data exchange between the MAC and next sublayer (6LoWPAN or higher).  \n   - **MLME-SAP** (MAC Management)  \n     - The SAP for management commands/notifications (e.g., initialization, configuration).\n\n4. **Physical Layer**  \n   - The lowest OSI layer, handling signal transmission/reception on the pilot line.  \n   - Provides raw bit-level data services and management functionalities.  \n   - **PD-SAP** (Physical Data)  \n     - The SAP for exchanging actual data bits with the MAC layer.  \n   - **PLME-SAP** (Physical Layer Management)  \n     - The SAP for controlling physical layer parameters (e.g., modulation schemes, frequency allocation).\n\n5. **Signal Coupling**  \n   - Shows how the physical layer interfaces with the cable, ensuring the PLC signal is superimposed on or extracted from the pilot line.\n\n6. **Communication Media**  \n   - The physical cable assembly (i.e., control pilot line) that carries the PLC signal to and from the EV (vehicle) and the charging station.\n\n7. **Pilot Line**  \n   - Indicates the actual line or conductor used for carrying the pilot signal, which also supports G3-PLC communication under ISO 15118.\n\n---\n\n## 3. Relation and Connection of the Entities\n\n1. **OSI Layers → Data Link & Physical Layers**  \n   - The top four OSI layers (Application, Presentation, Session, Transport) are not explicitly expanded in the G3-PLC architecture, but they logically pass data down through the Network layer.  \n   - The Network layer interacts with the **6LoWPAN Adaptation Sublayer**, which in turn passes data to/from the MAC layer.\n\n2. **Data Link Layer → MAC Layer**  \n   - The **6LoWPAN Adaptation Sublayer** and MAC layer together form the Data Link layer in the G3-PLC context.  \n   - **MCPS-SAP** (at the MAC layer boundary) is used for data traffic, while **MLME-SAP** is used for MAC management.\n\n3. **MAC Layer → Physical Layer**  \n   - Data frames and management commands move between the MAC (@ MCPS-SAP/MLME-SAP) and the Physical layer (@ PD-SAP/PLME-SAP) as data or control signals.  \n   - The MAC decides how and when to access the shared PLC medium, while the Physical layer actually transmits or receives the encoded signal.\n\n4. **Physical Layer → Signal Coupling → Communication Media**  \n   - The Physical layer’s output is coupled (via “Signal coupling”) onto the **Pilot line**.  \n   - **Communication media** is the actual cable, ensuring the signal travels between EV and charging station.\n\n5. **Covered by G3 Specification**  \n   - All shaded areas (Data Link and Physical layers, along with their sublayers and SAP interfaces) are under the scope of G3-PLC technology, as indicated by the “covered by G3 specification” label.\n\n---\n\n## 4. Additional Notes\n\n- **Data Link Control SAP**: Exposes link status and manages error handling for upper layers.  \n- **Physical Layer**: Implements the lowest-level signaling, enabling robust data exchange in the presence of noise/interference on the pilot line.  \n- **Signal Coupling**: Defined in the document section B.9 to describe how the G3-PLC signal is added to or extracted from the pilot line.  \n- **Communication Media**: The pilot line within the charging cable assembly is the medium for all PLC communication.  \n- **Annex B in ISO 15118-3**: Explains how G3-PLC maps to the Vehicle-to-Grid communication interface, describing these sublayers in detail.\n\n---\n\n### In Summary\n\n**Figure B.1** illustrates how G3-PLC’s MAC and Physical layers fit within the OSI model for ISO 15118’s Vehicle-to-Grid communication. Each service access point (SAP) defines a clear interface for data or management functionalities moving between sublayers. The final outcome is a coherent architecture allowing higher-level protocols (e.g., for EV charging, billing, and network communication) to transmit data over a robust, power-line-based physical medium.",
    "iso3-image_25.png": "**# Detailed Description of Figure B.2 — Coupling Circuit for G3 Technology on Pilot Wire**\n\nBelow is a step-by-step, detailed explanation of the schematic shown in “Figure B.2 — Coupling circuit for G3 technology on pilot wire.” This diagram illustrates how the high-frequency G3-PLC (IEEE 1901.2) communication signals are coupled to the control pilot line between an EVSE (Electric Vehicle Supply Equipment) and an EV (Electric Vehicle). Although it is presented more like a circuit diagram than a traditional “flow chart,” the following description walks through each component and path in order.\n\n---\n\n## 1. Diagram Overview\n\n- The diagram shows two main blocks labeled:\n  1. **modem on EVSE** (on the left side)  \n  2. **modem on EV** (on the right side)  \n\n- Between these two sides, there is a **pilot line** that incorporates inductors (Lx1, Lx2), resistors (Rx1, Rx2), coupling capacitors (Cx1, Cx2, Cx3, Cx4), and other passive components.  \n- Additional standard pilot-circuit elements (R1, C1, R2, R3, S1, etc.) are shown but described as “indicated for information only” in the standard.  \n- The cable assembly between the EVSE and EV is represented as **T2**, with an additional coupler T7 in the middle.  \n\n---\n\n## 2. Entities (Components) Listed\n\nBelow is a list of each labeled entity, along with its role or function as per the figure:\n\n1. **R1 (1 kΩ)**  \n   - Standard resistor connected from the EVSE’s supply to the pilot line. Part of the IEC 61851-1 pilot interface.\n\n2. **C1 (300 pF)**  \n   - A capacitor to ground from the pilot line on the EVSE side, also part of the pilot basic filtering.\n\n3. **0 (Ground reference)**  \n   - Denotes the reference node or chassis/earth ground on the EVSE side.\n\n4. **Lx1 (1 000 µH)** and **Rx1 (680 Ω)**  \n   - A series inductor and resistor inserted in the pilot line on the EVSE side.  \n   - These components help prevent the high-frequency PLC signal from being excessively attenuated or shorted to ground through other EVSE internal circuitry.\n\n5. **T2**  \n   - Represents the cable assembly carrying the pilot wire (and potentially other conductors) between the EVSE and the EV.\n\n6. **T7**  \n   - Shown in the middle, typically a coupling or test point (sometimes an additional physical coupler or choke) that is part of the overall pilot line path.\n\n7. **Lx2 (1 000 µH)** and **Rx2 (680 Ω)**  \n   - The second set of inductor/resistor in series with the pilot line, but on the EV side.  \n   - Same purpose as the Lx1 and Rx1 pair on the EVSE side: forming the series impedance to avoid shorting out high-frequency signals.\n\n8. **C2b (1 n?)**, **R2 (2.7 kΩ)**, **R3 (1.3 kΩ)**, **S1**  \n   - Shown on the EV side as part of the standard pilot-circuit elements, including the proximity detection or pilot detection circuit. From IEC 61851-1 perspective, R2, R3, and S1 are typical pilot-line components internal to the EV.\n\n9. **Modem 1 (EVSE Modem Block)**  \n   - Marked in the figure as “1.”  \n   - The G3-PLC modem on the EVSE side has two pins: **In** and **Out** for the high-frequency signals.\n   - It connects to the pilot line through coupling capacitors **Cx1 (500 pF)** and **Cx3 (< 500 pF)** and through resistors **Rx3 (1 kΩ)** and **Rx5 (> 10 kΩ)**.\n\n10. **Modem 2 (EV Modem Block)**  \n   - Marked in the figure as “2.”  \n   - The G3-PLC modem on the EV side, also with **In** and **Out** pins. \n   - It uses coupling capacitors **Cx2 (500 pF)** and **Cx4 (< 500 pF)** in conjunction with resistors **Rx4 (1 kΩ)** and **Rx6 (> 10 kΩ)**.\n\n11. **Cx1 (500 pF) / Cx2 (500 pF)**  \n   - Mandatory coupling capacitors for injecting and receiving the high-frequency PLC signals onto the pilot line.\n\n12. **Cx3 (< 500 pF) / Cx4 (< 500 pF)**  \n   - Additional coupling capacitors (generally smaller) that may be used on the input side for the modem to filter or shape signals.\n\n13. **Rx3 (1 kΩ) / Rx4 (1 kΩ)**  \n   - Represent the internal output impedance of the modem transmitter. They ensure that the voltage variations of the PLC signal remain within acceptable limits.\n\n14. **Rx5 (> 10 kΩ)** / **Rx6 (> 10 kΩ)**  \n   - Optional high-value input impedance resistors on the receiving end of the modem, limiting current draw and preserving the high-frequency signal.\n\n15. **C2a (1 nF)**  \n   - A capacitor bridging the mid-line in the schematic, typically providing low-impedance coupling for common-mode signals across T2/T7. Its exact function is to aid in the high-frequency path or EMI considerations.\n\n16. **Key**  \n   - The figure’s reference text indicates “1” is the modem on EVSE side and “2” is the modem on EV side.\n\n---\n\n## 3. Step-by-Step Signal/Circuit Path Description\n\nBecause this diagram is a coupling circuit rather than a traditional directional “flow chart,” the best way to describe its “flow” is to trace how a G3-PLC signal travels between the modems:\n\n1. **AC Pilot Supply and Pilot Reference (Left Most Side)**  \n   - A pilot signal or supply is connected through **R1 (1 kΩ)**.  \n   - **C1 (300 pF)** goes from the pilot conductor to ground (node “0”) for noise filtering.  \n\n2. **Series Inductor and Resistor on EVSE Side (Lx1 & Rx1)**  \n   - After leaving R1/C1, the pilot line passes through **Lx1 (1 000 µH)** in series with **Rx1 (680 Ω)**.  \n   - These form the mandatory high-frequency blocking or “choke” to keep the pilot circuit from shunting all high-frequency energy to ground.\n\n3. **Coupling to EVSE Modem (Block “1”)**  \n   - The pilot line node (between Lx1/Rx1 and T2/T7) goes to two coupling capacitors feeding the EVSE modem:  \n     - **Cx3 (< 500 pF)** → Possibly connected toward the modem **In** pin, with resistor **Rx5 (> 10 kΩ)** referencing input impedance to ground.  \n     - **Cx1 (500 pF)** → Possibly connected toward the modem **Out** pin, with resistor **Rx3 (1 kΩ)** as the modem’s internal source resistor for the HF signal.  \n   - These capacitors pass the high-frequency G3-PLC signals but block low-frequency or DC pilot currents.\n\n4. **Cable Assembly and Center Coupling (T2 and T7)**  \n   - **T2** is the physical cable from EVSE to EV, carrying the pilot conductor (and possibly other conductors).  \n   - **T7** is an in-line coupling element or test point. The standard simply shows T7 in the path, which might be used for measurement or for additional filtering.\n\n5. **Series Inductor and Resistor on EV Side (Lx2 & Rx2)**  \n   - On the vehicle side, the pilot conductor is again routed through another set of inductor and resistor: **Lx2 (1 000 µH)** and **Rx2 (680 Ω)**.  \n   - As on the EVSE side, Lx2 and Rx2 ensure that the EV’s internal pilot circuitry does not excessively load or short out the PLC signal.\n\n6. **EV Standard Pilot Connection (C2b, R2, R3, S1)**  \n   - The figure shows some typical pilot-circuit resistors **R2 (2.7 kΩ)**, **R3 (1.3 kΩ)**, and switch **S1**. These are part of the standard IEC 61851-1 pilot function for controlling and detecting EV presence or charging states.  \n   - A capacitor **C2b (1 n? )** may also appear, used for smoothing or filtering within the EV’s pilot logic.  \n\n7. **Coupling to EV Modem (Block “2”)**  \n   - Similar to the EVSE side, the EV modem connects to the pilot line through coupling capacitors and limiting resistors:  \n     - **Cx2 (500 pF)** is the main coupling capacitor for the high-frequency transmit/receive path.  \n     - **Rx4 (1 kΩ)** is the internal source/limiting resistor.  \n     - **Cx4 (< 500 pF)** could be the receive filter capacitor.  \n     - **Rx6 (> 10 kΩ)** is again an optional high-value input impedance resistor to ground.  \n\n8. **Signal Path for G3-PLC**  \n   - In essence, the G3-PLC signal travels from the EVSE modem (left block) → coupling capacitors (Cx1/Cx3) → pilot line through Lx1 + Rx1 → T2/T7 → Lx2 + Rx2 → coupling capacitors (Cx2/Cx4) → EV modem (right block).  \n   - The mandatory values of Lx1, Lx2 (each 1 000 µH), Rx1, Rx2 (each 680 Ω), and Cx1, Cx2 (each 500 pF) are specified to ensure consistent attenuation and adequate coupling across a wide frequency range, while also meeting EMC requirements.\n\n---\n\n## 4. Connections and Relationships\n\n- **Pilot Wire Core**: The pilot wire is the main conductor bridging EVSE and EV. It carries both the standard PWM pilot signal (per IEC 61851-1) and now the superimposed high-frequency G3-PLC signals.\n- **High-Frequency Isolation**:  \n  - Lx1, Rx1, Lx2, Rx2 form the series choke and damping sections.  \n  - These prevent the pilot line’s normal low-frequency control signal from interfering with G3-PLC, and vice versa.\n- **Coupling Capacitors**:  \n  - Cx1, Cx2 provide the primary path for injecting/extracting high-frequency signals to/from the pilot line.  \n  - Cx3, Cx4 are secondary capacitors for filtering or for the input side of the modem.\n- **Resistive Networks**:  \n  - Rx3, Rx4 are the output resistors from the modem perspective (limiting voltage amplitude).  \n  - Rx5, Rx6 are optional high-value input resistors to ground or to the reference inside the modem, allowing minimal loading.  \n- **Standard Pilot Components**:  \n  - R1, C1, R2, R3, and S1 are from IEC 61851-1 pilot circuit definition, ensuring safe operation and standardized detection of charge states. They are “informational” in this figure but included so that engineers see the complete interplay between pilot function and PLC signals.\n\n---\n\n## 5. Additional Notes from the Standard\n\n1. **Signal Level Requirements**  \n   - Per ISO 15118-3 and IEEE 1901.2 references, the PLC signal on the pilot wire is limited to 0.5 V RMS maximum (to avoid interference with pilot PWM) and at least 0.2 V RMS to ensure reliable communication.\n\n2. **Mandatory Coupling Values**  \n   - Inductors:  \n     - Lx1, Lx2 = 1 000 µH (each)  \n   - Resistors:  \n     - Rx1, Rx2 ≈ 680 Ω (each)  \n     - Rx3, Rx4 ≈ 1 kΩ (internal source)  \n     - Rx5, Rx6 > 10 kΩ (optional input)  \n   - Capacitors:  \n     - Cx1, Cx2 = 500 pF  \n     - Cx3, Cx4 < 500 pF (exact value can vary)  \n\n3. **EMC Compliance**  \n   - Clause B.10 in ISO 15118-3 references EMC requirements from IEEE 1901.2. Additional filtering or decoupling elements can be added to ensure no more than 0.5 V RMS on the pilot-based PWM signal.\n\n4. **Cable Assembly (T2)**  \n   - T2 denotes the physical link between EVSE and EV. The standard clarifies that cable/detachable connectors must accommodate the pilot line for both the low-frequency PWM and the high-frequency G3-PLC signals.\n\n---\n\n## 6. Practical Engineering Takeaways\n\n1. **Must-Have Components**:  \n   - Ensure the presence of inductors (Lx1, Lx2) and the coupling capacitors (Cx1, Cx2) per the mandatory values if implementing G3 technology on the pilot line.  \n2. **In-Modem Resistance**:  \n   - The 1 kΩ resistors (Rx3, Rx4) help maintain consistent pilot-wire voltage amplitude for the G3 signals.  \n3. **EMC & Filtering**:  \n   - Additional filtering on power lines (e.g., at the EVSE side) might be necessary in noisy environments.  \n4. **Pilot Circuit**:  \n   - R1, R2, R3, C1, and S1 remain part of basic pilot architecture per IEC 61851-1:2010 Annex A.\n\n---\n\n### In Summary\n\nFigure B.2 shows how a G3-PLC modem on both the EVSE (block “1”) and the EV (block “2”) couples their high-frequency communication signals onto the same pilot wire used for the standard IEC 61851-1 charging control. Key components—**Lx1, Lx2, Rx1, Rx2, Cx1, Cx2**—protect the pilot circuit from unwanted loading and allow reliable PLC signal transmission. The resistor-capacitor networks and optional additional filters ensure the PLC signal stays within required amplitude limits (0.2–0.5 V RMS) while still leaving the pilot function intact.\n\nEngineers referencing this figure should pay special attention to the mandatory component values and overall pilot-circuit layout, verifying that each device (EVSE and EV) implements these coupling elements as specified by ISO 15118-3, Annex B, and IEEE 1901.2 to ensure interoperability and EMC compliance."
}